Loading /home/ehm/.maxima/maxima-init.mac
(%i1) batch("examples.txt")

read and interpret /home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt
(%i2) (display2d:false,load(qm),0)
(%o2) 0
(%i3) psi_bra:a*dagger(zp)+b*dagger(zm)
(%o3) matrix([a,b])
(%i4) ket([a,b])+ket([c,d])
(%o4) ket([c,d])+ket([a,b])
(%i5) mket([a,b])
(%o5) matrix([a],[b])
(%i6) mbra([a,b])
(%o6) matrix([a,b])
(%i7) bell:(1/sqrt(2))*(ket([u,d])-ket([d,u]))
(%o7) (ket([u,d])-ket([d,u]))/sqrt(2)
(%i8) dagger(bell)
(%o8) (bra([u,d])-bra([d,u]))/sqrt(2)
(%i9) braket(bra([a1,b1]),ket([a2,b2]))
(%o9) kron_delta(a1,a2)*kron_delta(b1,b2)
(%i10) declare([a,b],complex)
(%o10) done
(%i11) psi:a*ket([1])+b*ket([2])
(%o11) ket([2])*b+ket([1])*a
(%i12) psidag:dagger(psi)
(%o12) bra([2])*conjugate(b)+bra([1])*conjugate(a)
(%i13) psidag . psi
(%o13) b*conjugate(b)+a*conjugate(a)
(%i14) declare([c1,c2],complex,r,real)
(%o14) done
(%i15) k:mket([c1,c2,r])
(%o15) matrix([c1],[c2],[r])
(%i16) b:dagger(k)
(%o16) matrix([conjugate(c1),conjugate(c2),r])
(%i17) b . k
(%o17) r^2+c2*conjugate(c2)+c1*conjugate(c1)
(%i18) k:ket([u,d])
(%o18) ket([u,d])
(%i19) b:bra([u,d])
(%o19) bra([u,d])
(%i20) b . k
(%o20) 1
(%i21) k:ket([u,d])
(%o21) ket([u,d])
(%i22) b:bra([u,d])
(%o22) bra([u,d])
(%i23) b . k
(%o23) 1
(%i24) declare([c1,c2],complex)
(%o24) done
(%i25) mket([c1,c2])
(%o25) matrix([c1],[c2])
(%i26) facts()
(%o26) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),
        kind(c1,complex),kind(c2,complex),kind(r,real)]
(%i27) k:ket([a,b])
(%o27) ket([a,bra([u,d])])
(%i28) mketp(k)
(%o28) false
(%i29) k:mket([a,b])
(%o29) matrix([a],[bra([u,d])])
(%i30) mketp(k)
(%o30) true
(%i31) kill(c1,c2)
(%o31) done
(%i32) mbra([c1,c2])
(%o32) matrix([c1,c2])
(%i33) facts()
(%o33) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i34) b:mbra([a,b])
(%o34) matrix([a,bra([u,d])])
(%i35) mbrap(b)
(%o35) true
(%i36) autoket([a,b])
(%o36) matrix([a],[matrix([a,bra([u,d])])])
(%i37) facts()
(%o37) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i38) autoket([a*sin(x),b*sin(x)])
(%o38) matrix([a*sin(x)],[matrix([a*sin(x),bra([u,d])*sin(x)])])
(%i39) facts()
(%o39) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i40) autobra([a,b])
(%o40) matrix([a,matrix([a,bra([u,d])])])
(%i41) facts()
(%o41) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i42) autobra([a*sin(x),b])
(%o42) matrix([a*sin(x),matrix([a,bra([u,d])])])
(%i43) facts()
(%o43) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i44) dagger(mbra([%i,2]))
(%o44) matrix([-%i],[2])
(%i45) declare([a,b,c],complex)
(%o45) done
(%i46) braket(mbra([a,b,c]),mket([a,b,c]))
(%o46) braket(matrix([a,matrix([a,bra([u,d])]),c]),
              matrix([a],[matrix([a,bra([u,d])])],[c]))
(%i47) braket(dagger(mket([a,b,c])),mket([a,b,c]))
(%o47) braket(matrix([conjugate(a),
                      matrix([conjugate(a),conjugate(bra([u,d]))]),
                      conjugate(c)]),matrix([a],[matrix([a,bra([u,d])])],[c]))
(%i48) braket(bra([a1,b1,c1]),ket([a2,b2,c2]))
(%o48) kron_delta(a1,a2)*kron_delta(b1,b2)*kron_delta(c1,c2)
(%i49) declare([a,b,c],complex)
(%o49) done
(%i50) norm(mket([a,b,c]))
(%o50) norm(matrix([a],[matrix([a,bra([u,d])])],[c]))
(%i51) declare([a,b,c,d],complex)
(%o51) done
(%i52) A:braket(mbra([a,b]),mket([c,d]))
(%o52) braket(matrix([a,matrix([a,bra([u,d])])]),matrix([c],[d]))
(%i53) P:magsqr(A)
(%o53) braket(matrix([a,matrix([a,bra([u,d])])]),matrix([c],[d]))
 *conjugate(braket(matrix([a,matrix([a,bra([u,d])])]),matrix([c],[d])))
(%i54) zp
(%o54) matrix([1],[0])
(%i55) zm
(%o55) matrix([0],[1])
(%i56) yp
(%o56) matrix([1/sqrt(2)],[%i/sqrt(2)])
(%i57) ym
(%o57) matrix([1/sqrt(2)],[-(%i/sqrt(2))])
(%i58) braket(dagger(xp),zp)
(%o58) 1/sqrt(2)
(%i59) declare([a,b],complex)
(%o59) done
(%i60) psi:mket([a,b])
(%o60) matrix([a],[matrix([a,bra([u,d])])])
(%i61) psi_x:'xp*braket(dagger(xp),psi)+'xm*braket(dagger(xm),psi)
(%o61) braket(matrix([1/sqrt(2),1/sqrt(2)]),matrix([a],
                                                   [matrix([a,bra([u,d])])]))*xp
 +braket(matrix([1/sqrt(2),-(1/sqrt(2))]),
         matrix([a],[matrix([a,bra([u,d])])]))
  *xm
(%i62) sigmay
(%o62) matrix([0,-%i],[%i,0])
(%i63) Sy
(%o63) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i64) commutator(Sx,Sy)
(%o64) matrix([(%i*hbar^2)/2,0],[0,-((%i*hbar^2)/2)])
(%i65) (1/2)*anticommutator(sigmax,sigmax)
(%o65) matrix([1,0],[0,1])
(%i66) SY(1/2)
(%o66) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i67) SX(1)
(%o67) matrix([0,hbar/sqrt(2),0],[hbar/sqrt(2),0,hbar/sqrt(2)],[0,
                                                                hbar/sqrt(2),
                                                                0])
(%i68) ev(expect(Sy,xp+ym),ratsimp)
(%o68) -hbar
(%i69) ev(qm_variance(Sy,xp+ym),ratsimp)
(%o69) (%i*hbar)/2
(%i70) SP(1)
(%o70) matrix([0,sqrt(2)*hbar,0],[0,0,sqrt(2)*hbar],[0,0,0])
(%i71) SM(1)
(%o71) matrix([0,0,0],[sqrt(2)*hbar,0,0],[0,sqrt(2)*hbar,0])
(%i72) RY(1,t)
Proviso: assuming 4*t # 0 
(%o72) matrix([(cos(t)+1)/2,-(sin(t)/sqrt(2)),(1-cos(t))/2],
              [sin(t)/sqrt(2),cos(t),-(sin(t)/sqrt(2))],
              [(1-cos(t))/2,sin(t)/sqrt(2),(cos(t)+1)/2])
(%i73) UU(w*Sy,t)
Proviso: assuming 64*t*w # 0 
(%o73) matrix([cos((t*w)/2),-sin((t*w)/2)],[sin((t*w)/2),cos((t*w)/2)])
(%i74) spin_mbra(3/2,1/2,2)
(%o74) matrix([sqrt(3)/2^(3/2),-(%i/2^(3/2)),1/2^(3/2),
               -((sqrt(3)*%i)/2^(3/2))])
(%i75) bra([3/2,1/2])
(%o75) bra([3/2,1/2])
(%i76) ket([3/2,1/2])
(%o76) ket([3/2,1/2])
(%i77) jmtop(3/2)
(%o77) ket([3/2,3/2])
(%i78) jmbot(3/2)
(%o78) ket([3/2,-(3/2)])
(%i79) jmket(3/2,1/2)
(%o79) ket([3/2,1/2])
(%i80) jmketp(ket([j,m]))
(%o80) false
(%i81) jmketp(ket([3/2,1/2]))
(%o81) true
(%i82) jmcheck(3/2,1/2)
(%o82) true
(%i83) k:ket([j,m])
(%o83) ket([j,m])
(%i84) Jp(k)
(%o84) hbar*ket([j,m+1])*sqrt(j*(j+1)-m*(m+1))
(%i85) Jm(k)
(%o85) hbar*ket([j,m-1])*sqrt(j*(j+1)-(m-1)*m)
(%i86) Jsqr(k)
(%o86) hbar^2*j*(j+1)*ket([j,m])
(%i87) Jz(k)
(%o87) hbar*ket([j,m])*m
(%i88) tpket(ket([3/2,1/2]),ket([1/2,1/2]))
(%o88) [tpket,1,ket([3/2,1/2]),ket([1/2,1/2])]
(%i89) tpbra(bra([3/2,1/2]),bra([1/2,1/2]))
(%o89) [tpbra,1,bra([3/2,1/2]),bra([1/2,1/2])]
(%i90) k:tpket(jmtop(1),jmbot(1))
(%o90) [tpket,1,ket([1,1]),ket([1,-1])]
(%i91) K:Jtsqr(k)
(%o91) [tpket,2*hbar^2,ket([1,1]),ket([1,-1])]
 +[tpket,2*hbar^2,ket([1,0]),ket([1,0])]
(%i92) B:tpdagger(k)
(%o92) [tpbra,1,bra([1,1]),bra([1,-1])]
(%i93) tpbraket(B,K)
(%o93) 2*hbar^2
(%i94) k1:tpket(ket([1/2,1/2]),ket([1/2,-1/2]))
(%o94) [tpket,1,ket([1/2,1/2]),ket([1/2,-(1/2)])]
(%i95) tpscmult(c,k1)
(%o95) [tpket,c,ket([1/2,1/2]),ket([1/2,-(1/2)])]
(%i96) k1:tpket(ket([1/2,1/2]),ket([1/2,-1/2]))
(%o96) [tpket,1,ket([1/2,1/2]),ket([1/2,-(1/2)])]
(%i97) k2:tpket(ket([1/2,-1/2]),ket([1/2,1/2]))
(%o97) [tpket,1,ket([1/2,-(1/2)]),ket([1/2,1/2])]
(%i98) tpadd(k1,k2)
(%o98) [tpket,1,ket([1/2,1/2]),ket([1/2,-(1/2)])]
 +[tpket,1,ket([1/2,-(1/2)]),ket([1/2,1/2])]
(%i99) k1:tpket(ket([1/2,1/2]),ket([1/2,-1/2]))
(%o99) [tpket,1,ket([1/2,1/2]),ket([1/2,-(1/2)])]
(%i100) tpdagger(k1)
(%o100) [tpbra,1,bra([1/2,1/2]),bra([1/2,-(1/2)])]
(%i101) k:tpket(ket([3/2,3/2]),ket([1/2,1/2]))
(%o101) [tpket,1,ket([3/2,3/2]),ket([1/2,1/2])]
(%i102) J1z(k)
(%o102) [tpket,(3*hbar)/2,ket([3/2,3/2]),ket([1/2,1/2])]
(%i103) J2z(k)
(%o103) [tpket,hbar/2,ket([3/2,3/2]),ket([1/2,1/2])]
(%i104) k:tpket(ket([3/2,3/2]),ket([1/2,1/2]))
(%o104) [tpket,1,ket([3/2,3/2]),ket([1/2,1/2])]
(%i105) Jtz(k)
(%o105) [tpket,2*hbar,ket([3/2,3/2]),ket([1/2,1/2])]
(%i106) k:tpket(ket([3/2,1/2]),ket([1/2,1/2]))
(%o106) [tpket,1,ket([3/2,1/2]),ket([1/2,1/2])]
(%i107) b:tpdagger(k)
(%o107) [tpbra,1,bra([3/2,1/2]),bra([1/2,1/2])]
(%i108) J1p2m(k)
(%o108) [tpket,sqrt(3)*hbar^2,ket([3/2,3/2]),ket([1/2,-(1/2)])]
(%i109) J1m2p(k)
(%o109) 0
(%i110) k:tpket(ket([3/2,-1/2]),ket([1/2,1/2]))
(%o110) [tpket,1,ket([3/2,-(1/2)]),ket([1/2,1/2])]
(%i111) B:tpdagger(k)
(%o111) [tpbra,1,bra([3/2,-(1/2)]),bra([1/2,1/2])]
(%i112) K2:Jtsqr(k)
(%o112) [tpket,4*hbar^2,ket([3/2,-(1/2)]),ket([1/2,1/2])]
 +[tpket,2*hbar^2,ket([3/2,1/2]),ket([1/2,-(1/2)])]
(%i113) tpbraket(B,K2)
(%o113) 4*hbar^2
(%i114) get_j(15/4)
(%o114) j = 3/2
(%i115) k:tpket(jmtop(1/2),jmtop(1))
(%o115) [tpket,1,ket([1/2,1/2]),ket([1,1])]
(%i116) Jtsqr(k)
(%o116) [tpket,(15*hbar^2)/4,ket([1/2,1/2]),ket([1,1])]
(%i117) get_j(15/4)
(%o117) j = 3/2
(%i118) k:tpket(jmtop(1/2),jmtop(1))
(%o118) [tpket,1,ket([1/2,1/2]),ket([1,1])]
(%i119) k2:Jtm(k)
(%o119) [tpket,sqrt(2)*hbar,ket([1/2,1/2]),ket([1,0])]
 +[tpket,hbar,ket([1/2,-(1/2)]),ket([1,1])]
(%i120) k3:Jtm(k2)
(%o120) [tpket,2^(3/2)*hbar^2,ket([1/2,-(1/2)]),ket([1,0])]
 +[tpket,2*hbar^2,ket([1/2,1/2]),ket([1,-1])]
(%i121) k4:Jtm(k3)
(%o121) [tpket,6*hbar^3,ket([1/2,-(1/2)]),ket([1,-1])]
(%i122) phi1:tpket(ket([1/2,1/2]),ket([1/2,1/2]))
(%o122) [tpket,1,ket([1/2,1/2]),ket([1/2,1/2])]
(%i123) phi2:tpket(ket([1/2,1/2]),ket([1/2,-1/2]))
(%o123) [tpket,1,ket([1/2,1/2]),ket([1/2,-(1/2)])]
(%i124) phi3:tpket(ket([1/2,-1/2]),ket([1/2,1/2]))
(%o124) [tpket,1,ket([1/2,-(1/2)]),ket([1/2,1/2])]
(%i125) phi4:tpket(ket([1/2,-1/2]),ket([1/2,-1/2]))
(%o125) [tpket,1,ket([1/2,-(1/2)]),ket([1/2,-(1/2)])]
(%i126) tpadd(J1z(phi1),tpscmult(-1,J2z(phi1)))
(%o126) 0
(%i127) tpadd(J1z(phi2),tpscmult(-1,J2z(phi2)))
(%o127) [tpket,hbar,ket([1/2,1/2]),ket([1/2,-(1/2)])]
(%i128) tpadd(J1z(phi3),tpscmult(-1,J2z(phi3)))
(%o128) [tpket,-hbar,ket([1/2,-(1/2)]),ket([1/2,1/2])]
(%i129) tpadd(J1z(phi4),tpscmult(-1,J2z(phi4)))
(%o129) 0
(%i130) top:tpket(jmtop(1/2),jmtop(1/2))
(%o130) [tpket,1,ket([1/2,1/2]),ket([1/2,1/2])]
(%i131) Jtsqr(top)
(%o131) [tpket,2*hbar^2,ket([1/2,1/2]),ket([1/2,1/2])]
(%i132) get_j(2)
(%o132) j = 1
(%i133) Jtz(top)
(%o133) [tpket,hbar,ket([1/2,1/2]),ket([1/2,1/2])]
(%i134) JMtop:ket([1,1])
(%o134) ket([1,1])
(%i135) mid:Jtm(top)
(%o135) [tpket,hbar,ket([1/2,1/2]),ket([1/2,-(1/2)])]
 +[tpket,hbar,ket([1/2,-(1/2)]),ket([1/2,1/2])]
(%i136) Jm(JMtop)
(%o136) sqrt(2)*ket([1,0])*hbar
(%i137) mid:tpscmult(1/(sqrt(2)*hbar),mid)
(%o137) [tpket,1/sqrt(2),ket([1/2,1/2]),ket([1/2,-(1/2)])]
 +[tpket,1/sqrt(2),ket([1/2,-(1/2)]),ket([1/2,1/2])]
(%i138) bot:Jtm(mid)
(%o138) [tpket,sqrt(2)*hbar,ket([1/2,-(1/2)]),ket([1/2,-(1/2)])]
(%i139) Jm(ket([1,0]))
(%o139) sqrt(2)*ket([1,-1])*hbar
(%i140) bot:tpscmult(1/(sqrt(2)*hbar),bot)
(%o140) [tpket,1,ket([1/2,-(1/2)]),ket([1/2,-(1/2)])]
(%i141) K:ket([a1,b1])
(%o141) ket([a1,b1])
(%i142) B:bra([a2,b2])
(%o142) bra([a2,b2])
(%i143) braket(B,K)
(%o143) kron_delta(a1,a2)*kron_delta(b1,b2)
(%i144) bra([a1,Id,c1]) . ket([a2,b2,c2])
(%o144) ket(["-",b2,"-"])*kron_delta(a1,a2)*kron_delta(c1,c2)
(%i145) bra([a1,b1,c1]) . ket([Id,b2,c2])
(%o145) bra([a1,"-","-"])*kron_delta(b1,b2)*kron_delta(c1,c2)
(%i146) bell:(1/sqrt(2))*(ket([u,d])-ket([d,u]))
(%o146) (ket([u,d])-ket([d,u]))/sqrt(2)
(%i147) rho:bell . dagger(bell)
(%o147) (ket([u,d]) . bra([u,d])-ket([u,d]) . bra([d,u])
                                -ket([d,u]) . bra([u,d])
                                +ket([d,u]) . bra([d,u]))
 /2
(%i148) assume(notequal(u,d))
(%o148) [notequal(u,d)]
(%i149) trace1:bra([u,Id]) . rho . ket([u,Id])+bra([d,Id]) . rho . ket([d,Id])
(%o149) ket(["-",u]) . bra(["-",u])/2+ket(["-",d]) . bra(["-",d])/2
(%i150) declare(n,integer,n,scalar)
(%o150) done
(%i151) ap . ket([n])
(%o151) sqrt(n+1)*ket([n+1])
(%i152) am . ket([n])
(%o152) ket([n-1])*sqrt(n)
/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt:152:23:incorrect syntax: ket is not an infix operator
[n]).(ap+am)^^4.ket(
                  ^
(%o154) "/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt"
