Loading /home/ehm/.maxima/maxima-init.mac
(%i1) batch("examples.txt")

read and interpret /home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt
(%i2) display2d:false
(%i3) load(qm)
(%i4) cvec(1,2,3)
(%o4) matrix([1],[2],[3])
(%i5) rvec(1,2,3)
(%o5) matrix([1,2,3])
(%i6) ket(c1,c2)
(%o6) matrix([c1],[c2])
(%i7) facts()
(%o7) [kind(hbar,real),hbar > 0,kind(c1,complex),kind(c2,complex)]
(%i8) bra(c1,c2)
(%o8) matrix([c1,c2])
(%i9) b:bra(a,b)
(%o9) matrix([a,b])
(%i10) ketp(b)
(%o10) false
(%i11) b:bra(a,b)
(%o11) matrix([a,matrix([a,b])])
(%i12) brap(b)
(%o12) false
(%i13) dag(bra(%i,2))
(%o13) matrix([-%i],[2])
(%i14) braket(ket(a,b,c),ket(a,b,c))
(%o14) false
(%i15) norm(ket(a,b,c))
(%o15) sqrt(false)
(%i16) A:braket(ket(a,b),ket(c,d))
(%o16) false
(%i17) P:magsqr(A)
(%o17) false*conjugate(false)
(%i18) rvec(a,b,c)
(%o18) matrix([a,matrix([a,matrix([a,b])]),c])
(%i19) facts()
(%o19) [kind(hbar,real),hbar > 0,kind(c1,complex),kind(c2,complex),
        kind(a,complex),kind(b,complex),kind(c,complex),kind(d,complex)]
(%i20) bra(a,b,c)
(%o20) matrix([a,matrix([a,matrix([a,b])]),c])
(%i21) facts()
(%o21) [kind(hbar,real),hbar > 0,kind(c1,complex),kind(c2,complex),
        kind(a,complex),kind(b,complex),kind(c,complex),kind(d,complex)]
(%i22) braket(bra(a,b,c),ket(a,b,c))
(%o22) false
(%i23) braket(ket(a,b,c),ket(a,b,c))
(%o23) false
(%i24) zp
(%o24) matrix([1],[0])
(%i25) zm
(%o25) matrix([0],[1])
(%i26) yp
(%o26) matrix([1/sqrt(2)],[%i/sqrt(2)])
(%i27) ym
(%o27) matrix([1/sqrt(2)],[-(%i/sqrt(2))])
(%i28) braket(xp,zp)
(%o28) 1/sqrt(2)
(%i29) psi:ket(a,b)
(%o29) matrix([a],[matrix([a,matrix([a,b])])])
(%i30) psi_x:'xp*braket(xp,psi)+'xm*braket(xm,psi)
(%o30) xp*false+xm*false
(%i31) sigmay
(%o31) matrix([0,-%i],[%i,0])
(%i32) Sy
(%o32) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i33) commutator(Sx,Sy)
(%o33) matrix([(%i*hbar^2)/2,0],[0,-((%i*hbar^2)/2)])
(%i34) SY(1/2)
(%o34) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i35) SX(1)
(%o35) matrix([0,hbar/sqrt(2),0],[hbar/sqrt(2),0,hbar/sqrt(2)],[0,
                                                                hbar/sqrt(2),
                                                                0])
(%i36) ev(expect(Sy,xp+ym),ratsimp)
(%o36) -hbar
(%i37) ev(qm_variance(Sy,xp+ym),ratsimp)
(%o37) (%i*hbar)/2
(%i38) jm_bra(3/2,1/2)
(%o38) [jmbra,matrix([3/2,1/2])]
(%i39) K:jm_ket(zp,zm)
(%o39) [jmket,matrix([matrix([1],[0])],[matrix([0],[1])])]
(%i40) B:jm_bra(zp,zm)
(%o40) [jmbra,matrix([matrix([1],[0]),matrix([0],[1])])]
(%i41) jm_braket(B,K)
(%o41) 1
(%i42) SP(1)
(%o42) matrix([0,sqrt(2)*hbar,0],[0,0,sqrt(2)*hbar],[0,0,0])
(%i43) SM(1)
(%o43) matrix([0,0,0],[sqrt(2)*hbar,0,0],[0,sqrt(2)*hbar,0])
(%i44) RZ(1/2,t)
Proviso: assuming 64*t # 0 
(%o44) matrix([%e^-((%i*t)/2),0],[0,%e^((%i*t)/2)])
(%i45) UU(w*Sy,t)
Proviso: assuming 64*t*w # 0 
(%o45) matrix([cos((t*w)/2),-sin((t*w)/2)],[sin((t*w)/2),cos((t*w)/2)])
(%i46) ketprod(zp,zm)
(%o46) [tpket,[matrix([1],[0]),matrix([0],[1])]]
(%i47) ketprod('zp,'zm)
(%o47) [tpket,[zp,zm]]
(%i48) kill(a,b,c,d)
(%o48) done
(%i49) braprod(bra(a,b),bra(c,d))
(%o49) [tpbra,[matrix([a,b]),matrix([c,d])]]
(%i50) braprod(dag(zp),bra(c,d))
(%o50) [tpbra,[matrix([1,0]),matrix([c,d])]]
(%i51) zpb:dag(zp)
(%o51) matrix([1,0])
(%i52) zmb:dag(zm)
(%o52) matrix([0,1])
(%i53) K:ketprod('zp,'zm)
(%o53) [tpket,[zp,zm]]
(%i54) B:braprod(zpb,zmb)
(%o54) [tpbra,[matrix([1,0]),matrix([0,1])]]
(%i55) B:braprod('zpb,'zmb)
(%o55) [tpbra,[zpb,zmb]]
(%i56) braketprod(K,B)
(%o56) false
(%i57) braketprod(B,K)
(%o57) zmb . zm*zpb . zp
(%o58) "/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt"
