Loading /home/ehm/.maxima/maxima-init.mac
(%i1) batch("examples.txt")

read and interpret /home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt
(%i2) display2d:false
(%i3) cvec(1,2,3)
(%o3) cvec(1,2,3)
(%i4) rvec(1,2,3)
(%o4) rvec(1,2,3)
(%i5) ket(c1,c2)
(%o5) ket(c1,c2)
(%i6) facts()
(%o6) []
(%i7) bra(c1,c2)
(%o7) bra(c1,c2)
(%i8) b:bra(a,b)
(%o8) bra(a,b)
(%i9) ketp(b)
(%o9) ketp(bra(a,b))
(%i10) b:bra(a,b)
(%o10) bra(a,bra(a,b))
(%i11) brap(b)
(%o11) brap(bra(a,bra(a,b)))
(%i12) dag(bra(%i,2))
(%o12) dag(bra(%i,2))
(%i13) braket(ket(a,b,c),ket(a,b,c))
(%o13) braket(ket(a,bra(a,bra(a,b)),c),ket(a,bra(a,bra(a,b)),c))
(%i14) norm(ket(a,b,c))
(%o14) norm(ket(a,bra(a,bra(a,b)),c))
(%i15) rvec(a,b,c)
(%o15) rvec(a,bra(a,bra(a,b)),c)
(%i16) facts()
(%o16) []
(%i17) bra(a,b,c)
(%o17) bra(a,bra(a,bra(a,b)),c)
(%i18) facts()
(%o18) []
(%i19) braket(bra(a,b,c),ket(a,b,c))
(%o19) braket(bra(a,bra(a,bra(a,b)),c),ket(a,bra(a,bra(a,b)),c))
(%i20) braket(ket(a,b,c),ket(a,b,c))
(%o20) braket(ket(a,bra(a,bra(a,b)),c),ket(a,bra(a,bra(a,b)),c))
(%i21) zp
(%o21) zp
(%i22) zm
(%o22) zm
(%i23) yp
(%o23) yp
(%i24) ym
(%o24) ym
(%i25) braket(xp,zp)
(%o25) braket(xp,zp)
(%i26) psi:ket(a,b)
(%o26) ket(a,bra(a,bra(a,b)))
(%i27) psi_x:'xp*braket(xp,psi)+'xm*braket(xm,psi)
(%o27) xp*braket(xp,ket(a,bra(a,bra(a,b))))+xm
                                            *braket(xm,ket(a,bra(a,bra(a,b))))
(%i28) sigmay
(%o28) sigmay
(%i29) Sy
(%o29) Sy
(%i30) SY(1/2)
(%o30) SY(1/2)
(%i31) SX(1)
(%o31) SX(1)
(%i32) ev(expect(Sy,xp+ym),ratsimp)
(%o32) expect(Sy,ym+xp)
(%i33) ev(qm_variance(Sy,xp+ym),ratsimp)
(%o33) qm_variance(Sy,ym+xp)
(%i34) jm_bra(3/2,1/2)
(%o34) jm_bra(3/2,1/2)
(%i35) K:jm_ket(zp,zm)
(%o35) jm_ket(zp,zm)
(%i36) B:jm_bra(zp,zm)
(%o36) jm_bra(zp,zm)
(%i37) jm_braket(B,K)
(%o37) jm_braket(jm_bra(zp,zm),jm_ket(zp,zm))
(%i38) SP(1)
(%o38) SP(1)
(%i39) SM(1)
(%o39) SM(1)
(%i40) RZ(1/2,t)
(%o40) RZ(1/2,t)
(%i41) UU(w*Sy,t)
(%o41) UU(Sy*w,t)
(%i42) ketprod(zp,zm)
(%o42) ketprod(zp,zm)
(%i43) ketprod('zp,'zm)
(%o43) ketprod(zp,zm)
(%i44) kill(a,b,c,d)
(%o44) done
(%i45) braprod(bra(a,b),bra(c,d))
(%o45) braprod(bra(a,b),bra(c,d))
(%i46) braprod(dag(zp),bra(c,d))
(%o46) braprod(dag(zp),bra(c,d))
(%i47) zpb:dag(zp)
(%o47) dag(zp)
(%i48) zmb:dag(zm)
(%o48) dag(zm)
(%i49) K:ketprod('zp,'zm)
(%o49) ketprod(zp,zm)
(%i50) B:braprod(zpb,zmb)
(%o50) braprod(dag(zp),dag(zm))
(%i51) B:braprod('zpb,'zmb)
(%o51) braprod(zpb,zmb)
(%i52) braketprod(K,B)
(%o52) braketprod(ketprod(zp,zm),braprod(zpb,zmb))
(%i53) braketprod(B,K)
(%o53) braketprod(braprod(zpb,zmb),ketprod(zp,zm))
(%o54) "/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt"
