Loading /home/ehm/.maxima/maxima-init.mac
(%i1) batch("examples.txt")

read and interpret /home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt
(%i2) display2d:false
(%i3) load(qm)
(%i4) ket(a,b)+ket(c,d)
(%o4) ket(c,d)+ket(a,b)
(%i5) ket([a,b])+ket([c,d])
(%o5) matrix([c+a],[d+b])
(%i6) ketprod('zp,'zm)+ketprod('zm,'zp)
(%o6) ketprod(zp,zm)+ketprod(zm,zp)
(%i7) ketprod([zp,zm])
(%o7) [tpket,[matrix([1],[0]),matrix([0],[1])]]
(%i8) kill(a)
(%o8) done
(%i9) ket(a)
(%o9) ket(a)
(%i10) declare([c1,c2],complex)
(%o10) done
(%i11) ket([c1,c2])
(%o11) matrix([c1],[c2])
(%i12) facts()
(%o12) [kind(hbar,real),hbar > 0,kind(c1,complex),kind(c2,complex)]
(%i13) kill(c1,c2)
(%o13) done
(%i14) bra(c1,c2)
(%o14) bra(c1,c2)
(%i15) bra([c1,c2])
(%o15) matrix([c1,c2])
(%i16) facts()
(%o16) [kind(hbar,real),hbar > 0]
(%i17) kill(a,b,k)
(%o17) done
(%i18) k:ket(a,b)
(%o18) ket(a,b)
(%i19) ketp(k)
(%o19) false
(%i20) k:ket([a,b])
(%o20) matrix([a],[b])
(%i21) ketp(k)
(%o21) true
(%i22) b:bra([a,b])
(%o22) matrix([a,b])
(%i23) brap(b)
(%o23) true
(%i24) dagger(bra([%i,2]))
(%o24) matrix([-%i],[2])
(%i25) declare([a,b,c],complex)
(%o25) done
(%i26) braket(ket([a,b,c]),ket([a,b,c]))
(%o26) braket(matrix([a],[matrix([a,b])],[c]),matrix([a],[matrix([a,b])],[c]))
(%i27) declare([a,b,c],complex)
(%o27) done
(%i28) norm(ket([a,b,c]))
(%o28) norm(matrix([a],[matrix([a,b])],[c]))
(%i29) norm(ket(a,b,c))
(%o29) norm(ket(a,matrix([a,b]),c))
(%i30) declare([a,b,c,d],complex)
(%o30) done
(%i31) A:braket(ket([a,b]),ket([c,d]))
(%o31) braket(matrix([a],[matrix([a,b])]),matrix([c],[d]))
(%i32) P:magsqr(A)
(%o32) braket(matrix([a],[matrix([a,b])]),matrix([c],[d]))
 *conjugate(braket(matrix([a],[matrix([a,b])]),matrix([c],[d])))
(%i33) ket(a)+ket(b)
(%o33) ket(matrix([a,b]))+ket(a)
(%i34) braket(bra(a),ket(b))
(%o34) 0
(%i35) braket(bra(a)+bra(c),ket(b))
(%o35) 0
(%i36) zp
(%o36) matrix([1],[0])
(%i37) zm
(%o37) matrix([0],[1])
(%i38) yp
(%o38) matrix([1/sqrt(2)],[%i/sqrt(2)])
(%i39) ym
(%o39) matrix([1/sqrt(2)],[-(%i/sqrt(2))])
(%i40) braket(xp,zp)
(%o40) 1/sqrt(2)
(%i41) declare([a,b],complex)
(%o41) done
(%i42) psi:ket([a,b])
(%o42) matrix([a],[matrix([a,b])])
(%i43) psi_x:'xp*braket(xp,psi)+'xm*braket(xm,psi)
(%o43) braket(matrix([1/sqrt(2)],[1/sqrt(2)]),matrix([a],[matrix([a,b])]))*xp
 +braket(matrix([1/sqrt(2)],[-(1/sqrt(2))]),matrix([a],[matrix([a,b])]))*xm
(%i44) sigmay
(%o44) matrix([0,-%i],[%i,0])
(%i45) Sy
(%o45) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i46) commutator(Sx,Sy)
(%o46) matrix([(%i*hbar^2)/2,0],[0,-((%i*hbar^2)/2)])
(%i47) SY(1/2)
(%o47) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i48) SX(1)
(%o48) matrix([0,hbar/sqrt(2),0],[hbar/sqrt(2),0,hbar/sqrt(2)],[0,
                                                                hbar/sqrt(2),
                                                                0])
(%i49) ev(expect(Sy,xp+ym),ratsimp)
(%o49) -hbar
(%i50) ev(qm_variance(Sy,xp+ym),ratsimp)
(%o50) (%i*hbar)/2
(%i51) jm_bra(3/2,1/2)
(%o51) jm_bra(3/2,1/2)
(%i52) jm_bra([3/2,1/2])
(%o52) [jmbra,matrix([3/2,1/2])]
(%i53) jm_ketp(jm_ket(j,m))
(%o53) false
(%i54) jm_ketp(jm_ket([j,m]))
(%o54) true
(%i55) jm_check(3/2,1/2)
(%o55) true
(%i56) K:jm_ket(j1,m1)
(%o56) jm_ket(j1,m1)
(%i57) B:jm_bra(j2,m2)
(%o57) jm_bra(j2,m2)
(%i58) jm_braket(B,K)
(%o58) kron_delta(j1,j2)*kron_delta(m1,m2)
(%i59) B:jm_bra(j1,m1)
(%o59) jm_bra(j1,m1)
(%i60) jm_braket(B,K)
(%o60) 1
(%i61) K:jm_ket([j1,m1])
(%o61) [jmket,matrix([j1,m1])]
(%i62) B:jm_bra([j2,m2])
(%o62) [jmbra,matrix([j2,m2])]
(%i63) jm_braket(B,K)
(%o63) 0
(%i64) jm_braket(jm_bra(j1,m1)+jm_bra(j3,m3),jm_ket(j2,m2))
(%o64) kron_delta(j2,j3)*kron_delta(m2,m3)+kron_delta(j1,j2)*kron_delta(m1,m2)
(%i65) k:jm_ket([j,m])
(%o65) [jmket,matrix([j,m])]
(%i66) JP(k)
(%o66) hbar*'jm_ket(j,m+1)*sqrt(j*(j+1)-m*(m+1))
(%i67) JM(k)
(%o67) hbar*'jm_ket(j,m-1)*sqrt(j*(j+1)-(m-1)*m)
(%i68) Jsqr(k)
(%o68) hbar^2*j*(j+1)*'jm_ket(j,m)
(%i69) Jz(k)
(%o69) hbar*'jm_ket(j,m)*m
(%i70) SP(1)
(%o70) matrix([0,sqrt(2)*hbar,0],[0,0,sqrt(2)*hbar],[0,0,0])
(%i71) SM(1)
(%o71) matrix([0,0,0],[sqrt(2)*hbar,0,0],[0,sqrt(2)*hbar,0])
(%i72) RZ(1/2,t)
Proviso: assuming 64*t # 0 
(%o72) matrix([%e^-((%i*t)/2),0],[0,%e^((%i*t)/2)])
(%i73) UU(w*Sy,t)
Proviso: assuming 64*t*w # 0 
(%o73) matrix([cos((t*w)/2),-sin((t*w)/2)],[sin((t*w)/2),cos((t*w)/2)])
(%i74) ketprod(zp,zm)
(%o74) ketprod(matrix([1],[0]),matrix([0],[1]))
(%i75) ketprod('zp,'zm)
(%o75) ketprod(zp,zm)
(%i76) kill(a,b,c,d)
(%o76) done
(%i77) declare([a,b,c,d],complex)
(%o77) done
(%i78) braprod(bra([a,b]),bra([c,d]))
(%o78) braprod(matrix([a,b]),matrix([c,d]))
(%i79) braprod(dagger(zp),bra([c,d]))
(%o79) braprod(matrix([1,0]),matrix([c,d]))
(%i80) K:ketprod(zp,zm)
(%o80) ketprod(matrix([1],[0]),matrix([0],[1]))
(%i81) zpb:dagger(zp)
(%o81) matrix([1,0])
(%i82) zmb:dagger(zm)
(%o82) matrix([0,1])
(%i83) B:braprod(zpb,zmb)
(%o83) braprod(matrix([1,0]),matrix([0,1]))
(%i84) braketprod(K,B)
(%o84) false
(%i85) braketprod(B,K)
(%o85) false
(%o86) "/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt"
