Loading /home/ehm/.maxima/maxima-init.mac
(%i1) batch("examples.txt")

read and interpret /home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt
(%i2) display2d:false
(%i3) load(qm)
(%i4) ket([a,b])+ket([c,d])
(%o4) ket([c,d])+ket([a,b])
(%i5) mket([a,b])+mket([c,d])
(%o5) matrix([c+a],[d+b])
(%i6) braket(bra([a1,b1]),ket([a2,b2]))
(%o6) kron_delta(a1,a2)*kron_delta(b1,b2)
(%i7) tpket('zp,'zm)+tpket('zm,'zp)
(%o7) tpket(zp,zm)+tpket(zm,zp)
(%i8) tpket([zp,zm])
(%o8) [tpket,[matrix([1],[0]),matrix([0],[1])]]
(%i9) declare([a,b],complex)
(%o9) done
(%i10) psi:a*ket([1])+b*ket([2])
(%o10) ket([2])*b+ket([1])*a
(%i11) psidag:dagger(psi)
(%o11) bra([2])*conjugate(b)+bra([1])*conjugate(a)
(%i12) psidag . psi
(%o12) b*conjugate(b)+a*conjugate(a)
(%i13) declare([c1,c2],complex,r,real)
(%o13) done
(%i14) k:mket([c1,c2,r])
(%o14) matrix([c1],[c2],[r])
(%i15) b:dagger(k)
(%o15) matrix([conjugate(c1),conjugate(c2),r])
(%i16) b . k
(%o16) r^2+c2*conjugate(c2)+c1*conjugate(c1)
(%i17) declare([c1,c2],complex)
(%o17) done
(%i18) mket([c1,c2])
(%o18) matrix([c1],[c2])
(%i19) facts()
(%o19) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),
        kind(c1,complex),kind(c2,complex),kind(r,real)]
(%i20) kill(c1,c2)
(%o20) done
(%i21) mbra([c1,c2])
(%o21) matrix([c1,c2])
(%i22) facts()
(%o22) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i23) k:ket([a,b])
(%o23) ket([a,matrix([conjugate(c1),conjugate(c2),r])])
(%i24) mketp(k)
(%o24) false
(%i25) k:mket([a,b])
(%o25) matrix([a],[matrix([conjugate(c1),conjugate(c2),r])])
(%i26) mketp(k)
(%o26) false
(%i27) b:mbra([a,b])
(%o27) matrix([a,matrix([conjugate(c1),conjugate(c2),r])])
(%i28) mbrap(b)
(%o28) false
(%i29) autoket([a,b])
(%o29) matrix([a],[matrix([a,matrix([conjugate(c1),conjugate(c2),r])])])
(%i30) facts()
(%o30) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i31) autoket([a*sin(x),b*sin(x)])
(%o31) matrix([a*sin(x)],
              [matrix([a*sin(x),
                       matrix([conjugate(c1)*sin(x),conjugate(c2)*sin(x),
                               r*sin(x)])])])
(%i32) facts()
(%o32) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i33) autobra([a,b])
(%o33) matrix([a,matrix([a,matrix([conjugate(c1),conjugate(c2),r])])])
(%i34) facts()
(%o34) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i35) autobra([a*sin(x),b])
(%o35) matrix([a*sin(x),matrix([a,matrix([conjugate(c1),conjugate(c2),r])])])
(%i36) facts()
(%o36) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i37) dagger(mbra([%i,2]))
(%o37) matrix([-%i],[2])
(%i38) declare([a,b,c],complex)
(%o38) done
(%i39) braket(mket([a,b,c]),mket([a,b,c]))
(%o39) braket(matrix([a],
                     [matrix([a,matrix([conjugate(c1),conjugate(c2),r])])],
                     [c]),
              matrix([a],
                     [matrix([a,matrix([conjugate(c1),conjugate(c2),r])])],
                     [c]))
(%i40) braket(ket([a1,b1,c1]),ket([a2,b2,c2]))
(%o40) braket(ket([a1,b1,c1]),ket([a2,b2,c2]))
(%i41) declare([a,b,c],complex)
(%o41) done
(%i42) norm(ket([a,b,c]))
(%o42) norm(ket([a,matrix([a,matrix([conjugate(c1),conjugate(c2),r])]),c]))
(%i43) norm(ket(a,b,c))
(%o43) norm(ket(a,matrix([a,matrix([conjugate(c1),conjugate(c2),r])]),c))
(%i44) declare([a,b,c,d],complex)
(%o44) done
(%i45) A:braket(ket([a,b]),ket([c,d]))
(%o45) braket(ket([a,matrix([a,matrix([conjugate(c1),conjugate(c2),r])])]),
              ket([c,d]))
(%i46) P:magsqr(A)
(%o46) braket(ket([a,matrix([a,matrix([conjugate(c1),conjugate(c2),r])])]),
              ket([c,d]))
 *conjugate(braket(ket([a,
                        matrix([a,matrix([conjugate(c1),conjugate(c2),r])])]),
                   ket([c,d])))
(%i47) ket([a])+ket([b])
(%o47) ket([matrix([a,matrix([conjugate(c1),conjugate(c2),r])])])+ket([a])
(%i48) braket(bra([a]),ket([b]))
(%o48) 0
(%i49) braket(bra([a])+bra([c]),ket([b]))
(%o49) 0
(%i50) zp
(%o50) matrix([1],[0])
(%i51) zm
(%o51) matrix([0],[1])
(%i52) yp
(%o52) matrix([1/sqrt(2)],[%i/sqrt(2)])
(%i53) ym
(%o53) matrix([1/sqrt(2)],[-(%i/sqrt(2))])
(%i54) braket(xp,zp)
(%o54) 1/sqrt(2)
(%i55) declare([a,b],complex)
(%o55) done
(%i56) psi:mket([a,b])
(%o56) matrix([a],[matrix([a,matrix([conjugate(c1),conjugate(c2),r])])])
(%i57) psi_x:'xp*braket(xp,psi)+'xm*braket(xm,psi)
(%o57) braket(matrix([1/sqrt(2)],[1/sqrt(2)]),
              matrix([a],
                     [matrix([a,matrix([conjugate(c1),conjugate(c2),r])])]))
 *xp
 +braket(matrix([1/sqrt(2)],[-(1/sqrt(2))]),
         matrix([a],[matrix([a,matrix([conjugate(c1),conjugate(c2),r])])]))
  *xm
(%i58) sigmay
(%o58) matrix([0,-%i],[%i,0])
(%i59) Sy
(%o59) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i60) commutator(Sx,Sy)
(%o60) matrix([(%i*hbar^2)/2,0],[0,-((%i*hbar^2)/2)])
(%i61) SY(1/2)
(%o61) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i62) SX(1)
(%o62) matrix([0,hbar/sqrt(2),0],[hbar/sqrt(2),0,hbar/sqrt(2)],[0,
                                                                hbar/sqrt(2),
                                                                0])
(%i63) ev(expect(Sy,xp+ym),ratsimp)
(%o63) -hbar
(%i64) ev(qm_variance(Sy,xp+ym),ratsimp)
(%o64) (%i*hbar)/2
(%i65) jmbra(3/2,1/2)
(%o65) jmbra(3/2,1/2)
(%i66) jmbra([3/2,1/2])
(%o66) [jmbra,matrix([3/2,1/2])]
(%i67) jmketp(jmket(j,m))
(%o67) false
(%i68) jmketp(jmket([j,m]))
(%o68) true
(%i69) jmcheck(3/2,1/2)
(%o69) true
(%i70) K:jmket(j1,m1)
(%o70) jmket(j1,m1)
(%i71) B:jmbra(j2,m2)
(%o71) jmbra(j2,m2)
(%i72) jmbraket(B,K)
(%o72) kron_delta(j1,j2)*kron_delta(m1,m2)
(%i73) B:jmbra(j1,m1)
(%o73) jmbra(j1,m1)
(%i74) jmbraket(B,K)
(%o74) 1
(%i75) K:jmket([3/2,1/2])
(%o75) [jmket,matrix([3/2,1/2])]
(%i76) B:jmbra([3/2,1/2])
(%o76) [jmbra,matrix([3/2,1/2])]
(%i77) jmbraket(B,K)
(%o77) 1
(%i78) jmbraket(jmbra(j1,m1),jmket(j2,m2))
(%o78) kron_delta(j1,j2)*kron_delta(m1,m2)
(%i79) k:jmket([j,m])
(%o79) [jmket,matrix([j,m])]
(%i80) JP(k)
(%o80) hbar*'jmket(j,m+1)*sqrt(j*(j+1)-m*(m+1))
(%i81) JM(k)
(%o81) hbar*'jmket(j,m-1)*sqrt(j*(j+1)-(m-1)*m)
(%i82) Jsqr(k)
(%o82) hbar^2*j*(j+1)*'jmket(j,m)
(%i83) Jz(k)
(%o83) hbar*'jmket(j,m)*m
(%i84) SP(1)
(%o84) matrix([0,sqrt(2)*hbar,0],[0,0,sqrt(2)*hbar],[0,0,0])
(%i85) SM(1)
(%o85) matrix([0,0,0],[sqrt(2)*hbar,0,0],[0,sqrt(2)*hbar,0])
(%i86) RZ(1/2,t)
Proviso: assuming 64*t # 0 
(%o86) matrix([%e^-((%i*t)/2),0],[0,%e^((%i*t)/2)])
(%i87) UU(w*Sy,t)
Proviso: assuming 64*t*w # 0 
(%o87) matrix([cos((t*w)/2),-sin((t*w)/2)],[sin((t*w)/2),cos((t*w)/2)])
(%i88) kill(a,b,c,d)
(%o88) done
(%i89) declare([a,b,c,d],complex)
(%o89) done
(%i90) tpbra([mbra([a,b]),mbra([c,d])])
(%o90) [tpbra,[matrix([a,b]),matrix([c,d])]]
(%i91) tpbra([dagger(zp),mbra([c,d])])
(%o91) [tpbra,[matrix([1,0]),matrix([c,d])]]
(%i92) K:tpket([zp,zm])
(%o92) [tpket,[matrix([1],[0]),matrix([0],[1])]]
(%i93) zpb:dagger(zp)
(%o93) matrix([1,0])
(%i94) zmb:dagger(zm)
(%o94) matrix([0,1])
(%i95) B:tpbra([zpb,zmb])
(%o95) [tpbra,[matrix([1,0]),matrix([0,1])]]
(%i96) tpbraket(K,B)
(%o96) false
(%i97) tpbraket(B,K)
(%o97) 1
(%i98) K:ket([a1,b1])
(%o98) ket([a1,b1])
(%i99) B:bra([a2,b2])
(%o99) bra([a2,b2])
(%i100) braket(B,K)
(%o100) kron_delta(a1,a2)*kron_delta(b1,b2)
(%i101) bra([a1,Id,c1]) . ket([a2,b2,c2])
(%o101) ket(["-",b2,"-"])*kron_delta(a1,a2)*kron_delta(c1,c2)
(%i102) bra([a1,b1,c1]) . ket([Id,b2,c2])
(%o102) bra([a1,"-","-"])*kron_delta(b1,b2)*kron_delta(c1,c2)
(%o103) "/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt"
