Loading /home/ehm/.maxima/maxima-init.mac
(%i1) batch("examples.txt")

read and interpret /home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt
(%i2) display2d:false
(%i3) load(qm)
(%i4) ket(a,b)+ket(c,d)
(%o4) ket(c,d)+ket(a,b)
(%i5) ket([a,b,c])+ket([d,e,f])
(%o5) matrix([d+a],[e+b],[f+c])
(%i6) ketprod('zp,'zm)+ketprod('zm,'zp)
(%o6) ketprod(zp,zm)+ketprod(zm,zp)
(%i7) ketprod([zp,zm])
(%o7) ketprod([matrix([1],[0]),matrix([0],[1])])
(%i8) declare([a,b],complex)
(%o8) done
(%i9) psi:a*ket(1)+b*ket(2)
(%o9) ket(2)*b+ket(1)*a
(%i10) psidag:dagger(psi)
(%o10) bra(2)*conjugate(b)+bra(1)*conjugate(a)
(%i11) psidag . psi
(%o11) b*conjugate(b)+a*conjugate(a)
(%i12) declare([c1,c2],complex,r,real)
(%o12) done
(%i13) k:ket([c1,c2,r])
(%o13) matrix([c1],[c2],[r])
(%i14) b:dagger(k)
(%o14) matrix([conjugate(c1),conjugate(c2),r])
(%i15) b . k
(%o15) r^2+c2*conjugate(c2)+c1*conjugate(c1)
(%i16) kill(a)
(%o16) done
(%i17) ket(a)
(%o17) ket(a)
(%i18) declare([c1,c2],complex)
(%o18) done
(%i19) ket([c1,c2])
(%o19) matrix([c1],[c2])
(%i20) facts()
(%o20) [kind(hbar,real),hbar > 0,kind(b,complex),kind(c1,complex),
        kind(c2,complex),kind(r,real)]
(%i21) kill(c1,c2)
(%o21) done
(%i22) bra(c1,c2)
(%o22) bra(c1,c2)
(%i23) bra([c1,c2])
(%o23) matrix([c1,c2])
(%i24) facts()
(%o24) [kind(hbar,real),hbar > 0,kind(b,complex),kind(r,real)]
(%i25) kill(a,b,k)
(%o25) done
(%i26) k:ket(a,b)
(%o26) ket(a,b)
(%i27) ketp(k)
(%o27) false
(%i28) k:ket([a,b])
(%o28) matrix([a],[b])
(%i29) ketp(k)
(%o29) true
(%i30) b:bra([a,b])
(%o30) matrix([a,b])
(%i31) brap(b)
(%o31) true
(%i32) autoket([a,b])
(%o32) matrix([a],[matrix([a,b])])
(%i33) facts()
(%o33) [kind(hbar,real),hbar > 0,kind(r,real),kind(a,complex)]
(%i34) autoket([a*sin(x),b*sin(x)])
(%o34) matrix([a*sin(x)],[matrix([a*sin(x),b*sin(x)])])
(%i35) facts()
(%o35) [kind(hbar,real),hbar > 0,kind(r,real),kind(a,complex)]
(%i36) autobra([a,b])
(%o36) matrix([a,matrix([a,b])])
(%i37) facts()
(%o37) [kind(hbar,real),hbar > 0,kind(r,real),kind(a,complex)]
(%i38) autobra([a*sin(x),b])
(%o38) matrix([a*sin(x),matrix([a,b])])
(%i39) facts()
(%o39) [kind(hbar,real),hbar > 0,kind(r,real),kind(a,complex)]
(%i40) dagger(bra([%i,2]))
(%o40) matrix([-%i],[2])
(%i41) declare([a,b,c],complex)
(%o41) done
(%i42) braket(ket([a,b,c]),ket([a,b,c]))
(%o42) braket(matrix([a],[matrix([a,b])],[c]),matrix([a],[matrix([a,b])],[c]))
(%i43) declare([a,b,c],complex)
(%o43) done
(%i44) norm(ket([a,b,c]))
(%o44) norm(matrix([a],[matrix([a,b])],[c]))
(%i45) norm(ket(a,b,c))
(%o45) norm(ket(a,matrix([a,b]),c))
(%i46) declare([a,b,c,d],complex)
(%o46) done
(%i47) A:braket(ket([a,b]),ket([c,d]))
(%o47) braket(matrix([a],[matrix([a,b])]),matrix([c],[d]))
(%i48) P:magsqr(A)
(%o48) braket(matrix([a],[matrix([a,b])]),matrix([c],[d]))
 *conjugate(braket(matrix([a],[matrix([a,b])]),matrix([c],[d])))
(%i49) ket(a)+ket(b)
(%o49) ket(matrix([a,b]))+ket(a)
(%i50) braket(bra(a),ket(b))
(%o50) 0
(%i51) braket(bra(a)+bra(c),ket(b))
(%o51) 0
(%i52) zp
(%o52) matrix([1],[0])
(%i53) zm
(%o53) matrix([0],[1])
(%i54) yp
(%o54) matrix([1/sqrt(2)],[%i/sqrt(2)])
(%i55) ym
(%o55) matrix([1/sqrt(2)],[-(%i/sqrt(2))])
(%i56) braket(xp,zp)
(%o56) 1/sqrt(2)
(%i57) declare([a,b],complex)
(%o57) done
(%i58) psi:ket([a,b])
(%o58) matrix([a],[matrix([a,b])])
(%i59) psi_x:'xp*braket(xp,psi)+'xm*braket(xm,psi)
(%o59) braket(matrix([1/sqrt(2)],[1/sqrt(2)]),matrix([a],[matrix([a,b])]))*xp
 +braket(matrix([1/sqrt(2)],[-(1/sqrt(2))]),matrix([a],[matrix([a,b])]))*xm
(%i60) sigmay
(%o60) matrix([0,-%i],[%i,0])
(%i61) Sy
(%o61) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i62) commutator(Sx,Sy)
(%o62) matrix([(%i*hbar^2)/2,0],[0,-((%i*hbar^2)/2)])
(%i63) SY(1/2)
(%o63) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i64) SX(1)
(%o64) matrix([0,hbar/sqrt(2),0],[hbar/sqrt(2),0,hbar/sqrt(2)],[0,
                                                                hbar/sqrt(2),
                                                                0])
(%i65) ev(expect(Sy,xp+ym),ratsimp)
(%o65) -hbar
(%i66) ev(qm_variance(Sy,xp+ym),ratsimp)
(%o66) (%i*hbar)/2
(%i67) jmbra(3/2,1/2)
(%o67) jmbra(3/2,1/2)
(%i68) jmbra([3/2,1/2])
(%o68) [jmbra,matrix([3/2,1/2])]
(%i69) jmketp(jmket(j,m))
(%o69) false
(%i70) jmketp(jmket([j,m]))
(%o70) true
(%i71) jmcheck(3/2,1/2)
(%o71) true
(%i72) K:jmket(j1,m1)
(%o72) jmket(j1,m1)
(%i73) B:jmbra(j2,m2)
(%o73) jmbra(j2,m2)
(%i74) jmbraket(B,K)
(%o74) kron_delta(j1,j2)*kron_delta(m1,m2)
(%i75) B:jmbra(j1,m1)
(%o75) jmbra(j1,m1)
(%i76) jmbraket(B,K)
(%o76) 1
(%i77) K:jmket([3/2,1/2])
(%o77) [jmket,matrix([3/2,1/2])]
(%i78) B:jmbra([3/2,1/2])
(%o78) [jmbra,matrix([3/2,1/2])]
(%i79) jmbraket(B,K)
(%o79) 1
(%i80) jmbraket(jmbra(j1,m1),jmket(j2,m2))
(%o80) kron_delta(j1,j2)*kron_delta(m1,m2)
(%i81) k:jmket([j,m])
(%o81) [jmket,matrix([j,m])]
(%i82) JP(k)
(%o82) hbar*'jmket(j,m+1)*sqrt(j*(j+1)-m*(m+1))
(%i83) JM(k)
(%o83) hbar*'jmket(j,m-1)*sqrt(j*(j+1)-(m-1)*m)
(%i84) Jsqr(k)
(%o84) hbar^2*j*(j+1)*'jmket(j,m)
(%i85) Jz(k)
(%o85) hbar*'jmket(j,m)*m
(%i86) SP(1)
(%o86) matrix([0,sqrt(2)*hbar,0],[0,0,sqrt(2)*hbar],[0,0,0])
(%i87) SM(1)
(%o87) matrix([0,0,0],[sqrt(2)*hbar,0,0],[0,sqrt(2)*hbar,0])
(%i88) RZ(1/2,t)
Proviso: assuming 64*t # 0 
(%o88) matrix([%e^-((%i*t)/2),0],[0,%e^((%i*t)/2)])
(%i89) UU(w*Sy,t)
Proviso: assuming 64*t*w # 0 
(%o89) matrix([cos((t*w)/2),-sin((t*w)/2)],[sin((t*w)/2),cos((t*w)/2)])
(%i90) tpket(zp,zm)
(%o90) tpket(matrix([1],[0]),matrix([0],[1]))
(%i91) tpket('zp,'zm)
(%o91) tpket(zp,zm)
(%i92) tpket([zp,zm])
(%o92) [tpket,[matrix([1],[0]),matrix([0],[1])]]
(%i93) kill(a,b,c,d)
(%o93) done
(%i94) declare([a,b,c,d],complex)
(%o94) done
(%i95) tpbra([bra([a,b]),bra([c,d])])
(%o95) [tpbra,[matrix([a,b]),matrix([c,d])]]
(%i96) tpbra([dagger(zp),bra([c,d])])
(%o96) [tpbra,[matrix([1,0]),matrix([c,d])]]
(%i97) K:tpket([zp,zm])
(%o97) [tpket,[matrix([1],[0]),matrix([0],[1])]]
(%i98) zpb:dagger(zp)
(%o98) matrix([1,0])
(%i99) zmb:dagger(zm)
(%o99) matrix([0,1])
(%i100) B:tpbra([zpb,zmb])
(%o100) [tpbra,[matrix([1,0]),matrix([0,1])]]
(%i101) tpbraket(K,B)
(%o101) false
(%i102) tpbraket(B,K)
(%o102) 1
(%o103) "/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt"
