Loading /home/ehm/.maxima/maxima-init.mac
(%i1) batch("examples.txt")

read and interpret /home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt
(%i2) display2d:false
(%i3) load(qm)
(%i4) cvec(1,2,3)
(%o4) matrix([1],[2],[3])
(%i5) rvec(1,2,3)
(%o5) matrix([1,2,3])
(%i6) ket(c1,c2)
(%o6) matrix([c1],[c2])
(%i7) facts()
(%o7) [kind(hbar,real),hbar > 0,kind(c1,complex),kind(c2,complex)]
(%i8) bra(c1,c2)
(%o8) matrix([c1,c2])
(%i9) b:bra(a,b)
(%o9) matrix([a,b])
(%i10) ketp(b)
(%o10) false
(%i11) b:bra(a,b)
(%o11) matrix([a,matrix([a,b])])
(%i12) brap(b)
(%o12) false
(%i13) dag(bra(%i,2))
(%o13) matrix([-%i],[2])
(%i14) braket(ket(a,b,c),ket(a,b,c))
(%o14) false
(%i15) norm(ket(a,b,c))
(%o15) sqrt(false)
(%i16) rvec(a,b,c)
(%o16) matrix([a,matrix([a,matrix([a,b])]),c])
(%i17) facts()
(%o17) [kind(hbar,real),hbar > 0,kind(c1,complex),kind(c2,complex),
        kind(a,complex),kind(b,complex),kind(c,complex)]
(%i18) bra(a,b,c)
(%o18) matrix([a,matrix([a,matrix([a,b])]),c])
(%i19) facts()
(%o19) [kind(hbar,real),hbar > 0,kind(c1,complex),kind(c2,complex),
        kind(a,complex),kind(b,complex),kind(c,complex)]
(%i20) braket(bra(a,b,c),ket(a,b,c))
(%o20) false
(%i21) braket(ket(a,b,c),ket(a,b,c))
(%o21) false
(%i22) zp
(%o22) matrix([1],[0])
(%i23) zm
(%o23) matrix([0],[1])
(%i24) yp
(%o24) matrix([1/sqrt(2)],[%i/sqrt(2)])
(%i25) ym
(%o25) matrix([1/sqrt(2)],[-(%i/sqrt(2))])
(%i26) braket(xp,zp)
(%o26) 1/sqrt(2)
(%i27) psi:ket(a,b)
(%o27) matrix([a],[matrix([a,matrix([a,b])])])
(%i28) psi_x:'xp*braket(xp,psi)+'xm*braket(xm,psi)
(%o28) xp*false+xm*false
(%i29) sigmay
(%o29) matrix([0,-%i],[%i,0])
(%i30) Sy
(%o30) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i31) SY(1/2)
(%o31) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i32) SX(1)
(%o32) matrix([0,hbar/sqrt(2),0],[hbar/sqrt(2),0,hbar/sqrt(2)],[0,
                                                                hbar/sqrt(2),
                                                                0])
(%i33) ev(expect(Sy,xp+ym),ratsimp)
(%o33) -hbar
(%i34) ev(qm_variance(Sy,xp+ym),ratsimp)
(%o34) (%i*hbar)/2
(%i35) jm_bra(3/2,1/2)
(%o35) [jmbra,matrix([3/2,1/2])]
(%i36) K:jm_ket(zp,zm)
(%o36) [jmket,matrix([matrix([1],[0])],[matrix([0],[1])])]
(%i37) B:jm_bra(zp,zm)
(%o37) [jmbra,matrix([matrix([1],[0]),matrix([0],[1])])]
(%i38) jm_braket(B,K)
(%o38) 1
(%i39) SP(1)
(%o39) matrix([0,sqrt(2)*hbar,0],[0,0,sqrt(2)*hbar],[0,0,0])
(%i40) SM(1)
(%o40) matrix([0,0,0],[sqrt(2)*hbar,0,0],[0,sqrt(2)*hbar,0])
(%i41) RZ(1/2,t)
Proviso: assuming 64*t # 0 
(%o41) matrix([%e^-((%i*t)/2),0],[0,%e^((%i*t)/2)])
(%i42) UU(w*Sy,t)
Proviso: assuming 64*t*w # 0 
(%o42) matrix([cos((t*w)/2),-sin((t*w)/2)],[sin((t*w)/2),cos((t*w)/2)])
(%i43) ketprod(zp,zm)
(%o43) [tpket,[matrix([1],[0]),matrix([0],[1])]]
(%i44) ketprod('zp,'zm)
(%o44) [tpket,[zp,zm]]
(%i45) kill(a,b,c,d)
(%o45) done
(%i46) braprod(bra(a,b),bra(c,d))
(%o46) [tpbra,[matrix([a,b]),matrix([c,d])]]
(%i47) braprod(dag(zp),bra(c,d))
(%o47) [tpbra,[matrix([1,0]),matrix([c,d])]]
(%i48) zpb:dag(zp)
(%o48) matrix([1,0])
(%i49) zmb:dag(zm)
(%o49) matrix([0,1])
(%i50) K:ketprod('zp,'zm)
(%o50) [tpket,[zp,zm]]
(%i51) B:braprod(zpb,zmb)
(%o51) [tpbra,[matrix([1,0]),matrix([0,1])]]
(%i52) B:braprod('zpb,'zmb)
(%o52) [tpbra,[zpb,zmb]]
(%i53) braketprod(K,B)
(%o53) false
(%i54) braketprod(B,K)
(%o54) zmb . zm*zpb . zp
(%o55) "/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt"
