Loading /home/ehm/.maxima/maxima-init.mac
(%i1) batch("examples.txt")

read and interpret /home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt
(%i2) (display2d:false,load(qm),0)
(%o2) 0
(%i3) psi_bra:a*dagger(zp)+b*dagger(zm)
(%o3) matrix([a,b])
(%i4) ket([a,b])+ket([c,d])
(%o4) ket([c,d])+ket([a,b])
(%i5) mket([a,b])
(%o5) matrix([a],[b])
(%i6) mbra([a,b])
(%o6) matrix([a,b])
(%i7) bell:(1/sqrt(2))*(ket([u,d])-ket([d,u]))
(%o7) (ket([u,d])-ket([d,u]))/sqrt(2)
(%i8) dagger(bell)
(%o8) (bra([u,d])-bra([d,u]))/sqrt(2)
(%i9) braket(bra([a1,b1]),ket([a2,b2]))
(%o9) kron_delta(a1,a2)*kron_delta(b1,b2)
(%i10) declare([a,b],complex)
(%o10) done
(%i11) psi:a*ket([1])+b*ket([2])
(%o11) ket([2])*b+ket([1])*a
(%i12) psidag:dagger(psi)
(%o12) bra([2])*conjugate(b)+bra([1])*conjugate(a)
(%i13) psidag . psi
(%o13) b*conjugate(b)+a*conjugate(a)
(%i14) declare([c1,c2],complex,r,real)
(%o14) done
(%i15) k:mket([c1,c2,r])
(%o15) matrix([c1],[c2],[r])
(%i16) b:dagger(k)
(%o16) matrix([conjugate(c1),conjugate(c2),r])
(%i17) b . k
(%o17) r^2+c2*conjugate(c2)+c1*conjugate(c1)
(%i18) k:ket([u,d])
(%o18) ket([u,d])
(%i19) b:bra([u,d])
(%o19) bra([u,d])
(%i20) b . k
(%o20) 1
(%i21) k:ket([u,d])
(%o21) ket([u,d])
(%i22) b:bra([u,d])
(%o22) bra([u,d])
(%i23) b . k
(%o23) 1
(%i24) declare([c1,c2],complex)
(%o24) done
(%i25) mket([c1,c2])
(%o25) matrix([c1],[c2])
(%i26) facts()
(%o26) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),
        kind(c1,complex),kind(c2,complex),kind(r,real)]
(%i27) k:ket([a,b])
(%o27) ket([a,bra([u,d])])
(%i28) mketp(k)
(%o28) false
(%i29) k:mket([a,b])
(%o29) matrix([a],[bra([u,d])])
(%i30) mketp(k)
(%o30) true
(%i31) kill(c1,c2)
(%o31) done
(%i32) mbra([c1,c2])
(%o32) matrix([c1,c2])
(%i33) facts()
(%o33) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i34) b:mbra([a,b])
(%o34) matrix([a,bra([u,d])])
(%i35) mbrap(b)
(%o35) true
(%i36) autoket([a,b])
(%o36) matrix([a],[matrix([a,bra([u,d])])])
(%i37) facts()
(%o37) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i38) autoket([a*sin(x),b*sin(x)])
(%o38) matrix([a*sin(x)],[matrix([a*sin(x),bra([u,d])*sin(x)])])
(%i39) facts()
(%o39) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i40) autobra([a,b])
(%o40) matrix([a,matrix([a,bra([u,d])])])
(%i41) facts()
(%o41) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i42) autobra([a*sin(x),b])
(%o42) matrix([a*sin(x),matrix([a,bra([u,d])])])
(%i43) facts()
(%o43) [kind(hbar,real),hbar > 0,kind(a,complex),kind(b,complex),kind(r,real)]
(%i44) dagger(mbra([%i,2]))
(%o44) matrix([-%i],[2])
(%i45) declare([a,b,c],complex)
(%o45) done
(%i46) braket(mbra([a,b,c]),mket([a,b,c]))
(%o46) braket(matrix([a,matrix([a,bra([u,d])]),c]),
              matrix([a],[matrix([a,bra([u,d])])],[c]))
(%i47) braket(dagger(mket([a,b,c])),mket([a,b,c]))
(%o47) braket(matrix([conjugate(a),
                      matrix([conjugate(a),conjugate(bra([u,d]))]),
                      conjugate(c)]),matrix([a],[matrix([a,bra([u,d])])],[c]))
(%i48) braket(bra([a1,b1,c1]),ket([a2,b2,c2]))
(%o48) kron_delta(a1,a2)*kron_delta(b1,b2)*kron_delta(c1,c2)
(%i49) declare([a,b,c],complex)
(%o49) done
(%i50) norm(mket([a,b,c]))
(%o50) norm(matrix([a],[matrix([a,bra([u,d])])],[c]))
(%i51) declare([a,b,c,d],complex)
(%o51) done
(%i52) A:braket(mbra([a,b]),mket([c,d]))
(%o52) braket(matrix([a,matrix([a,bra([u,d])])]),matrix([c],[d]))
(%i53) P:magsqr(A)
(%o53) braket(matrix([a,matrix([a,bra([u,d])])]),matrix([c],[d]))
 *conjugate(braket(matrix([a,matrix([a,bra([u,d])])]),matrix([c],[d])))
(%i54) zp
(%o54) matrix([1],[0])
(%i55) zm
(%o55) matrix([0],[1])
(%i56) yp
(%o56) matrix([1/sqrt(2)],[%i/sqrt(2)])
(%i57) ym
(%o57) matrix([1/sqrt(2)],[-(%i/sqrt(2))])
(%i58) braket(dagger(xp),zp)
(%o58) 1/sqrt(2)
(%i59) declare([a,b],complex)
(%o59) done
(%i60) psi:mket([a,b])
(%o60) matrix([a],[matrix([a,bra([u,d])])])
(%i61) psi_x:'xp*braket(dagger(xp),psi)+'xm*braket(dagger(xm),psi)
(%o61) braket(matrix([1/sqrt(2),1/sqrt(2)]),matrix([a],
                                                   [matrix([a,bra([u,d])])]))*xp
 +braket(matrix([1/sqrt(2),-(1/sqrt(2))]),
         matrix([a],[matrix([a,bra([u,d])])]))
  *xm
(%i62) sigmay
(%o62) matrix([0,-%i],[%i,0])
(%i63) Sy
(%o63) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i64) commutator(Sx,Sy)
(%o64) matrix([(%i*hbar^2)/2,0],[0,-((%i*hbar^2)/2)])
(%i65) (1/2)*anticommutator(sigmax,sigmax)
(%o65) matrix([1,0],[0,1])
(%i66) SY(1/2)
(%o66) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i67) SX(1)
(%o67) matrix([0,hbar/sqrt(2),0],[hbar/sqrt(2),0,hbar/sqrt(2)],[0,
                                                                hbar/sqrt(2),
                                                                0])
(%i68) ev(expect(Sy,xp+ym),ratsimp)
(%o68) -hbar
(%i69) ev(qm_variance(Sy,xp+ym),ratsimp)
(%o69) (%i*hbar)/2
(%i70) spin_mket(3/2,1/2,2)
(%o70) matrix([sqrt(3)/2^(3/2)],[%i/2^(3/2)],[1/2^(3/2)],[
                                                          (sqrt(3)*%i)
                                                           /2^(3/2)])
(%i71) spin_mbra(1,1,1)
(%o71) matrix([1/2,1/sqrt(2),1/2])
(%i72) bra([3/2,1/2])
(%o72) bra([3/2,1/2])
(%i73) ket([3/2,1/2])
(%o73) ket([3/2,1/2])
(%i74) jmtop(3/2)
(%o74) ket([3/2,3/2])
(%i75) jmbot(3/2)
(%o75) ket([3/2,-(3/2)])
(%i76) jmket(3/2,1/2)
(%o76) ket([3/2,1/2])
(%i77) jmketp(ket([j,m]))
(%o77) false
(%i78) jmketp(ket([3/2,1/2]))
(%o78) true
(%i79) jmcheck(3/2,1/2)
(%o79) true
(%i80) k:ket([j,m])
(%o80) ket([j,m])
(%i81) JP(k)
(%o81) hbar*ket([j,m+1])*sqrt(j*(j+1)-m*(m+1))
(%i82) JM(k)
(%o82) hbar*ket([j,m-1])*sqrt(j*(j+1)-(m-1)*m)
(%i83) Jsqr(k)
(%o83) hbar^2*j*(j+1)*ket([j,m])
(%i84) Jz(k)
(%o84) hbar*ket([j,m])*m
(%i85) tpket(ket([3/2,1/2]),ket([1/2,1/2]))
(%o85) [tpket,1,ket([3/2,1/2]),ket([1/2,1/2])]
(%i86) tpbra(bra([3/2,1/2]),bra([1/2,1/2]))
(%o86) [tpbra,1,bra([3/2,1/2]),bra([1/2,1/2])]
(%i87) k:tpket(jmtop(1),jmbot(1))
(%o87) [tpket,1,ket([1,1]),ket([1,-1])]
(%i88) K:Jtsqr(k)
(%o88) [tpket,2*hbar^2,ket([1,1]),ket([1,-1])]
 +[tpket,2*hbar^2,ket([1,0]),ket([1,0])]
(%i89) B:tpdagger(k)
(%o89) [tpbra,1,bra([1,1]),bra([1,-1])]
(%i90) tpbraket(B,K)
"Inputs must be a single tpbra and tpket."

(%o90) done
(%i91) tpbraket(B,part(K,1))
(%o91) 2*hbar^2
(%i92) tpbraket(B,part(K,2))
(%o92) 0
(%i93) k1:tpket(ket([1/2,1/2]),ket([1/2,-1/2]))
(%o93) [tpket,1,ket([1/2,1/2]),ket([1/2,-(1/2)])]
(%i94) tpscmult(c,k1)
(%o94) [tpket,c,ket([1/2,1/2]),ket([1/2,-(1/2)])]
(%i95) k1:tpket(ket([1/2,1/2]),ket([1/2,-1/2]))
(%o95) [tpket,1,ket([1/2,1/2]),ket([1/2,-(1/2)])]
(%i96) k2:tpket(ket([1/2,-1/2]),ket([1/2,1/2]))
(%o96) [tpket,1,ket([1/2,-(1/2)]),ket([1/2,1/2])]
(%i97) tpadd(k1,k2)
(%o97) [tpket,1,ket([1/2,1/2]),ket([1/2,-(1/2)])]
 +[tpket,1,ket([1/2,-(1/2)]),ket([1/2,1/2])]
(%i98) k1:tpket(ket([1/2,1/2]),ket([1/2,-1/2]))
(%o98) [tpket,1,ket([1/2,1/2]),ket([1/2,-(1/2)])]
(%i99) tpdagger(k1)
(%o99) [tpbra,1,bra([1/2,1/2]),bra([1/2,-(1/2)])]
(%i100) k:tpket(ket([3/2,3/2]),ket([1/2,1/2]))
(%o100) [tpket,1,ket([3/2,3/2]),ket([1/2,1/2])]
(%i101) J1z(k)
(%o101) [tpket,(3*hbar)/2,ket([3/2,3/2]),ket([1/2,1/2])]
(%i102) J2z(k)
(%o102) [tpket,hbar/2,ket([3/2,3/2]),ket([1/2,1/2])]
(%i103) k:tpket(ket([3/2,3/2]),ket([1/2,1/2]))
(%o103) [tpket,1,ket([3/2,3/2]),ket([1/2,1/2])]
(%i104) Jtz(k)
(%o104) [tpket,2*hbar,ket([3/2,3/2]),ket([1/2,1/2])]
(%i105) k:tpket(ket([3/2,1/2]),ket([1/2,1/2]))
(%o105) [tpket,1,ket([3/2,1/2]),ket([1/2,1/2])]
(%i106) b:tpdagger(k)
(%o106) [tpbra,1,bra([3/2,1/2]),bra([1/2,1/2])]
(%i107) J1p2m(k)
(%o107) [tpket,sqrt(3)*hbar^2,ket([3/2,3/2]),ket([1/2,-(1/2)])]
(%i108) J1m2p(k)
(%o108) 0
(%i109) k:tpket(ket([3/2,-1/2]),ket([1/2,1/2]))
(%o109) [tpket,1,ket([3/2,-(1/2)]),ket([1/2,1/2])]
(%i110) K1:J1zJ2z(k)
(%o110) [tpket,-(hbar^2/4),ket([3/2,-(1/2)]),ket([1/2,1/2])]
(%i111) K2:Jtsqr(k)
(%o111) [tpket,4*hbar^2,ket([3/2,-(1/2)]),ket([1/2,1/2])]
 +[tpket,2*hbar^2,ket([3/2,1/2]),ket([1/2,-(1/2)])]
(%i112) tpbraket(tpdagger(K1),part(K2,1))
(%o112) -hbar^4
(%i113) phi1:tpket(ket([1/2,1/2]),ket([1/2,1/2]))
(%o113) [tpket,1,ket([1/2,1/2]),ket([1/2,1/2])]
(%i114) phi2:tpket(ket([1/2,1/2]),ket([1/2,-1/2]))
(%o114) [tpket,1,ket([1/2,1/2]),ket([1/2,-(1/2)])]
(%i115) phi3:tpket(ket([1/2,-1/2]),ket([1/2,1/2]))
(%o115) [tpket,1,ket([1/2,-(1/2)]),ket([1/2,1/2])]
(%i116) phi4:tpket(ket([1/2,-1/2]),ket([1/2,-1/2]))
(%o116) [tpket,1,ket([1/2,-(1/2)]),ket([1/2,-(1/2)])]
(%i117) tpadd(J1z(phi1),tpscmult(-1,J2z(phi1)))
(%o117) 0
(%i118) tpadd(J1z(phi2),tpscmult(-1,J2z(phi2)))
(%o118) [tpket,hbar,ket([1/2,1/2]),ket([1/2,-(1/2)])]
(%i119) tpadd(J1z(phi3),tpscmult(-1,J2z(phi3)))
(%o119) [tpket,-hbar,ket([1/2,-(1/2)]),ket([1/2,1/2])]
(%i120) tpadd(J1z(phi4),tpscmult(-1,J2z(phi4)))
(%o120) 0
(%i121) SP(1)
(%o121) matrix([0,sqrt(2)*hbar,0],[0,0,sqrt(2)*hbar],[0,0,0])
(%i122) SM(1)
(%o122) matrix([0,0,0],[sqrt(2)*hbar,0,0],[0,sqrt(2)*hbar,0])
(%i123) RY(1,t)
Proviso: assuming 4*t # 0 
(%o123) matrix([(cos(t)+1)/2,-(sin(t)/sqrt(2)),(1-cos(t))/2],
               [sin(t)/sqrt(2),cos(t),-(sin(t)/sqrt(2))],
               [(1-cos(t))/2,sin(t)/sqrt(2),(cos(t)+1)/2])
(%i124) UU(w*Sy,t)
Proviso: assuming 64*t*w # 0 
(%o124) matrix([cos((t*w)/2),-sin((t*w)/2)],[sin((t*w)/2),cos((t*w)/2)])
(%i125) K:ket([a1,b1])
(%o125) ket([a1,b1])
(%i126) B:bra([a2,b2])
(%o126) bra([a2,b2])
(%i127) braket(B,K)
(%o127) kron_delta(a1,a2)*kron_delta(b1,b2)
(%i128) bra([a1,Id,c1]) . ket([a2,b2,c2])
(%o128) ket(["-",b2,"-"])*kron_delta(a1,a2)*kron_delta(c1,c2)
(%i129) bra([a1,b1,c1]) . ket([Id,b2,c2])
(%o129) bra([a1,"-","-"])*kron_delta(b1,b2)*kron_delta(c1,c2)
(%i130) bell:(1/sqrt(2))*(ket([u,d])-ket([d,u]))
(%o130) (ket([u,d])-ket([d,u]))/sqrt(2)
(%i131) rho:bell . dagger(bell)
(%o131) (ket([u,d]) . bra([u,d])-ket([u,d]) . bra([d,u])
                                -ket([d,u]) . bra([u,d])
                                +ket([d,u]) . bra([d,u]))
 /2
(%i132) assume(notequal(u,d))
(%o132) [notequal(u,d)]
(%i133) trace1:bra([u,Id]) . rho . ket([u,Id])+bra([d,Id]) . rho . ket([d,Id])
(%o133) ket(["-",u]) . bra(["-",u])/2+ket(["-",d]) . bra(["-",d])/2
(%i134) declare(n,integer,n,scalar)
(%o134) done
(%i135) ap . ket([n])
(%o135) sqrt(n+1)*ket([n+1])
(%i136) am . ket([n])
(%o136) ket([n-1])*sqrt(n)
/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt:136:23:incorrect syntax: ket is not an infix operator
[n]).(ap+am)^^4.ket(
                  ^
(%o138) "/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt"
