Loading /home/ehm/.maxima/maxima-init.mac
(%i1) batch("examples.txt")

read and interpret /home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt
(%i2) display2d:false
(%i3) load(qm)
(%i4) ket(a,b)+ket(c,d)
(%o4) ket(c,d)+ket(a,b)
(%i5) ket([a,b,c])+ket([d,e,f])
(%o5) matrix([d+a],[e+b],[f+c])
(%i6) ketprod('zp,'zm)+ketprod('zm,'zp)
(%o6) ketprod(zp,zm)+ketprod(zm,zp)
(%i7) ketprod([zp,zm])
(%o7) [tpket,[matrix([1],[0]),matrix([0],[1])]]
(%i8) declare([a,b],complex)
(%o8) done
(%i9) psi:a*ket(1)+b*ket(2)
(%o9) ket(2)*b+ket(1)*a
(%i10) psidag:dagger(psi)
(%o10) bra(2)*conjugate(b)+bra(1)*conjugate(a)
(%i11) psidag . psi
(%o11) b*conjugate(b)+a*conjugate(a)
(%i12) declare([c1,c2],complex,r,real)
(%o12) done
(%i13) k:ket([c1,c2,r])
(%o13) matrix([c1],[c2],[r])
(%i14) b:dagger(k)
(%o14) matrix([conjugate(c1),conjugate(c2),r])
(%i15) b . k
(%o15) r^2+c2*conjugate(c2)+c1*conjugate(c1)
(%i16) kill(a)
(%o16) done
(%i17) ket(a)
(%o17) ket(a)
(%i18) declare([c1,c2],complex)
(%o18) done
(%i19) ket([c1,c2])
(%o19) matrix([c1],[c2])
(%i20) facts()
(%o20) [kind(hbar,real),hbar > 0,kind(b,complex),kind(c1,complex),
        kind(c2,complex),kind(r,real)]
(%i21) kill(c1,c2)
(%o21) done
(%i22) bra(c1,c2)
(%o22) bra(c1,c2)
(%i23) bra([c1,c2])
(%o23) matrix([c1,c2])
(%i24) facts()
(%o24) [kind(hbar,real),hbar > 0,kind(b,complex),kind(r,real)]
(%i25) kill(a,b,k)
(%o25) done
(%i26) k:ket(a,b)
(%o26) ket(a,b)
(%i27) ketp(k)
(%o27) false
(%i28) k:ket([a,b])
(%o28) matrix([a],[b])
(%i29) ketp(k)
(%o29) true
(%i30) b:bra([a,b])
(%o30) matrix([a,b])
(%i31) brap(b)
(%o31) true
(%i32) autoket([a,b])
(%o32) matrix([a],[matrix([a,b])])
(%i33) facts()
(%o33) [kind(hbar,real),hbar > 0,kind(r,real),kind(a,complex)]
(%i34) autoket([a*sin(x),b*sin(x)])
(%o34) matrix([a*sin(x)],[matrix([a*sin(x),b*sin(x)])])
(%i35) autobra([a,b,c])
(%o35) matrix([a,matrix([a,b]),c])
(%i36) facts()
(%o36) [kind(hbar,real),hbar > 0,kind(r,real),kind(a,complex),kind(c,complex)]
(%i37) autobra([a*sin(x)+b*sin(x),c])
(%o37) matrix([matrix([2*a*sin(x),b*sin(x)+a*sin(x)]),c])
(%i38) dagger(bra([%i,2]))
(%o38) matrix([-%i],[2])
(%i39) declare([a,b,c],complex)
(%o39) done
(%i40) braket(ket([a,b,c]),ket([a,b,c]))
(%o40) braket(matrix([a],[matrix([a,b])],[c]),matrix([a],[matrix([a,b])],[c]))
(%i41) declare([a,b,c],complex)
(%o41) done
(%i42) norm(ket([a,b,c]))
(%o42) norm(matrix([a],[matrix([a,b])],[c]))
(%i43) norm(ket(a,b,c))
(%o43) norm(ket(a,matrix([a,b]),c))
(%i44) declare([a,b,c,d],complex)
(%o44) done
(%i45) A:braket(ket([a,b]),ket([c,d]))
(%o45) braket(matrix([a],[matrix([a,b])]),matrix([c],[d]))
(%i46) P:magsqr(A)
(%o46) braket(matrix([a],[matrix([a,b])]),matrix([c],[d]))
 *conjugate(braket(matrix([a],[matrix([a,b])]),matrix([c],[d])))
(%i47) ket(a)+ket(b)
(%o47) ket(matrix([a,b]))+ket(a)
(%i48) braket(bra(a),ket(b))
(%o48) 0
(%i49) braket(bra(a)+bra(c),ket(b))
(%o49) 0
(%i50) zp
(%o50) matrix([1],[0])
(%i51) zm
(%o51) matrix([0],[1])
(%i52) yp
(%o52) matrix([1/sqrt(2)],[%i/sqrt(2)])
(%i53) ym
(%o53) matrix([1/sqrt(2)],[-(%i/sqrt(2))])
(%i54) braket(xp,zp)
(%o54) 1/sqrt(2)
(%i55) declare([a,b],complex)
(%o55) done
(%i56) psi:ket([a,b])
(%o56) matrix([a],[matrix([a,b])])
(%i57) psi_x:'xp*braket(xp,psi)+'xm*braket(xm,psi)
(%o57) braket(matrix([1/sqrt(2)],[1/sqrt(2)]),matrix([a],[matrix([a,b])]))*xp
 +braket(matrix([1/sqrt(2)],[-(1/sqrt(2))]),matrix([a],[matrix([a,b])]))*xm
(%i58) sigmay
(%o58) matrix([0,-%i],[%i,0])
(%i59) Sy
(%o59) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i60) commutator(Sx,Sy)
(%o60) matrix([(%i*hbar^2)/2,0],[0,-((%i*hbar^2)/2)])
(%i61) SY(1/2)
(%o61) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i62) SX(1)
(%o62) matrix([0,hbar/sqrt(2),0],[hbar/sqrt(2),0,hbar/sqrt(2)],[0,
                                                                hbar/sqrt(2),
                                                                0])
(%i63) ev(expect(Sy,xp+ym),ratsimp)
(%o63) -hbar
(%i64) ev(qm_variance(Sy,xp+ym),ratsimp)
(%o64) (%i*hbar)/2
(%i65) jm_bra(3/2,1/2)
(%o65) jm_bra(3/2,1/2)
(%i66) jm_bra([3/2,1/2])
(%o66) [jmbra,matrix([3/2,1/2])]
(%i67) jm_ketp(jm_ket(j,m))
(%o67) false
(%i68) jm_ketp(jm_ket([j,m]))
(%o68) true
(%i69) jm_check(3/2,1/2)
(%o69) true
(%i70) K:jm_ket(j1,m1)
(%o70) jm_ket(j1,m1)
(%i71) B:jm_bra(j2,m2)
(%o71) jm_bra(j2,m2)
(%i72) jm_braket(B,K)
(%o72) kron_delta(j1,j2)*kron_delta(m1,m2)
(%i73) B:jm_bra(j1,m1)
(%o73) jm_bra(j1,m1)
(%i74) jm_braket(B,K)
(%o74) 1
(%i75) K:jm_ket([j1,m1])
(%o75) [jmket,matrix([j1,m1])]
(%i76) B:jm_bra([j2,m2])
(%o76) [jmbra,matrix([j2,m2])]
(%i77) jm_braket(B,K)
(%o77) 0
(%i78) jm_braket(jm_bra(j1,m1)+jm_bra(j3,m3),jm_ket(j2,m2))
(%o78) kron_delta(j2,j3)*kron_delta(m2,m3)+kron_delta(j1,j2)*kron_delta(m1,m2)
(%i79) k:jm_ket([j,m])
(%o79) [jmket,matrix([j,m])]
(%i80) JP(k)
(%o80) hbar*'jm_ket(j,m+1)*sqrt(j*(j+1)-m*(m+1))
(%i81) JM(k)
(%o81) hbar*'jm_ket(j,m-1)*sqrt(j*(j+1)-(m-1)*m)
(%i82) Jsqr(k)
(%o82) hbar^2*j*(j+1)*'jm_ket(j,m)
(%i83) Jz(k)
(%o83) hbar*'jm_ket(j,m)*m
(%i84) SP(1)
(%o84) matrix([0,sqrt(2)*hbar,0],[0,0,sqrt(2)*hbar],[0,0,0])
(%i85) SM(1)
(%o85) matrix([0,0,0],[sqrt(2)*hbar,0,0],[0,sqrt(2)*hbar,0])
(%i86) RZ(1/2,t)
Proviso: assuming 64*t # 0 
(%o86) matrix([%e^-((%i*t)/2),0],[0,%e^((%i*t)/2)])
(%i87) UU(w*Sy,t)
Proviso: assuming 64*t*w # 0 
(%o87) matrix([cos((t*w)/2),-sin((t*w)/2)],[sin((t*w)/2),cos((t*w)/2)])
(%i88) ketprod(zp,zm)
(%o88) ketprod(matrix([1],[0]),matrix([0],[1]))
(%i89) ketprod('zp,'zm)
(%o89) ketprod(zp,zm)
(%i90) kill(a,b,c,d)
(%o90) done
(%i91) declare([a,b,c,d],complex)
(%o91) done
(%i92) braprod(bra([a,b]),bra([c,d]))
(%o92) braprod(matrix([a,b]),matrix([c,d]))
(%i93) braprod(dagger(zp),bra([c,d]))
(%o93) braprod(matrix([1,0]),matrix([c,d]))
(%i94) K:ketprod(zp,zm)
(%o94) ketprod(matrix([1],[0]),matrix([0],[1]))
(%i95) zpb:dagger(zp)
(%o95) matrix([1,0])
(%i96) zmb:dagger(zm)
(%o96) matrix([0,1])
(%i97) B:braprod(zpb,zmb)
(%o97) braprod(matrix([1,0]),matrix([0,1]))
(%i98) braketprod(K,B)
(%o98) false
(%i99) braketprod(B,K)
(%o99) false
(%o100) "/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt"
