Loading /home/ehm/.maxima/maxima-init.mac
(%i1) batch("examples.txt")

read and interpret /home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt
(%i2) display2d:false
(%i3) load(qm)
(%i4) ket(a,b)+ket(c,d)
(%o4) ket(c,d)+ket(a,b)
(%i5) ket([a,b,c])+ket([d,e,f])
(%o5) matrix([d+a],[e+b],[f+c])
(%i6) ketprod('zp,'zm)+ketprod('zm,'zp)
(%o6) ketprod(zp,zm)+ketprod(zm,zp)
(%i7) ketprod([zp,zm])
(%o7) [tpket,[matrix([1],[0]),matrix([0],[1])]]
(%i8) declare([a,b],complex)
(%o8) done
(%i9) psi:a*ket(1)+b*ket(2)
(%o9) ket(2)*b+ket(1)*a
(%i10) psidag:dagger(psi)
(%o10) bra(2)*conjugate(b)+bra(1)*conjugate(a)
(%i11) psidag . psi
(%o11) b*conjugate(b)+a*conjugate(a)
(%i12) declare([c1,c2],complex,r,real)
(%o12) done
(%i13) k:ket([c1,c2,r])
(%o13) matrix([c1],[c2],[r])
(%i14) b:dagger(k)
(%o14) matrix([conjugate(c1),conjugate(c2),r])
(%i15) b . k
(%o15) r^2+c2*conjugate(c2)+c1*conjugate(c1)
(%i16) kill(a)
(%o16) done
(%i17) ket(a)
(%o17) ket(a)
(%i18) declare([c1,c2],complex)
(%o18) done
(%i19) ket([c1,c2])
(%o19) matrix([c1],[c2])
(%i20) facts()
(%o20) [kind(hbar,real),hbar > 0,kind(b,complex),kind(c1,complex),
        kind(c2,complex),kind(r,real)]
(%i21) kill(c1,c2)
(%o21) done
(%i22) bra(c1,c2)
(%o22) bra(c1,c2)
(%i23) bra([c1,c2])
(%o23) matrix([c1,c2])
(%i24) facts()
(%o24) [kind(hbar,real),hbar > 0,kind(b,complex),kind(r,real)]
(%i25) kill(a,b,k)
(%o25) done
(%i26) k:ket(a,b)
(%o26) ket(a,b)
(%i27) ketp(k)
(%o27) false
(%i28) k:ket([a,b])
(%o28) matrix([a],[b])
(%i29) ketp(k)
(%o29) true
(%i30) b:bra([a,b])
(%o30) matrix([a,b])
(%i31) brap(b)
(%o31) true
(%i32) dagger(bra([%i,2]))
(%o32) matrix([-%i],[2])
(%i33) declare([a,b,c],complex)
(%o33) done
(%i34) braket(ket([a,b,c]),ket([a,b,c]))
(%o34) braket(matrix([a],[matrix([a,b])],[c]),matrix([a],[matrix([a,b])],[c]))
(%i35) declare([a,b,c],complex)
(%o35) done
(%i36) norm(ket([a,b,c]))
(%o36) norm(matrix([a],[matrix([a,b])],[c]))
(%i37) norm(ket(a,b,c))
(%o37) norm(ket(a,matrix([a,b]),c))
(%i38) declare([a,b,c,d],complex)
(%o38) done
(%i39) A:braket(ket([a,b]),ket([c,d]))
(%o39) braket(matrix([a],[matrix([a,b])]),matrix([c],[d]))
(%i40) P:magsqr(A)
(%o40) braket(matrix([a],[matrix([a,b])]),matrix([c],[d]))
 *conjugate(braket(matrix([a],[matrix([a,b])]),matrix([c],[d])))
(%i41) ket(a)+ket(b)
(%o41) ket(matrix([a,b]))+ket(a)
(%i42) braket(bra(a),ket(b))
(%o42) 0
(%i43) braket(bra(a)+bra(c),ket(b))
(%o43) 0
(%i44) zp
(%o44) matrix([1],[0])
(%i45) zm
(%o45) matrix([0],[1])
(%i46) yp
(%o46) matrix([1/sqrt(2)],[%i/sqrt(2)])
(%i47) ym
(%o47) matrix([1/sqrt(2)],[-(%i/sqrt(2))])
(%i48) braket(xp,zp)
(%o48) 1/sqrt(2)
(%i49) declare([a,b],complex)
(%o49) done
(%i50) psi:ket([a,b])
(%o50) matrix([a],[matrix([a,b])])
(%i51) psi_x:'xp*braket(xp,psi)+'xm*braket(xm,psi)
(%o51) braket(matrix([1/sqrt(2)],[1/sqrt(2)]),matrix([a],[matrix([a,b])]))*xp
 +braket(matrix([1/sqrt(2)],[-(1/sqrt(2))]),matrix([a],[matrix([a,b])]))*xm
(%i52) sigmay
(%o52) matrix([0,-%i],[%i,0])
(%i53) Sy
(%o53) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i54) commutator(Sx,Sy)
(%o54) matrix([(%i*hbar^2)/2,0],[0,-((%i*hbar^2)/2)])
(%i55) SY(1/2)
(%o55) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i56) SX(1)
(%o56) matrix([0,hbar/sqrt(2),0],[hbar/sqrt(2),0,hbar/sqrt(2)],[0,
                                                                hbar/sqrt(2),
                                                                0])
(%i57) ev(expect(Sy,xp+ym),ratsimp)
(%o57) -hbar
(%i58) ev(qm_variance(Sy,xp+ym),ratsimp)
(%o58) (%i*hbar)/2
(%i59) jm_bra(3/2,1/2)
(%o59) jm_bra(3/2,1/2)
(%i60) jm_bra([3/2,1/2])
(%o60) [jmbra,matrix([3/2,1/2])]
(%i61) jm_ketp(jm_ket(j,m))
(%o61) false
(%i62) jm_ketp(jm_ket([j,m]))
(%o62) true
(%i63) jm_check(3/2,1/2)
(%o63) true
(%i64) K:jm_ket(j1,m1)
(%o64) jm_ket(j1,m1)
(%i65) B:jm_bra(j2,m2)
(%o65) jm_bra(j2,m2)
(%i66) jm_braket(B,K)
(%o66) kron_delta(j1,j2)*kron_delta(m1,m2)
(%i67) B:jm_bra(j1,m1)
(%o67) jm_bra(j1,m1)
(%i68) jm_braket(B,K)
(%o68) 1
(%i69) K:jm_ket([j1,m1])
(%o69) [jmket,matrix([j1,m1])]
(%i70) B:jm_bra([j2,m2])
(%o70) [jmbra,matrix([j2,m2])]
(%i71) jm_braket(B,K)
(%o71) 0
(%i72) jm_braket(jm_bra(j1,m1)+jm_bra(j3,m3),jm_ket(j2,m2))
(%o72) kron_delta(j2,j3)*kron_delta(m2,m3)+kron_delta(j1,j2)*kron_delta(m1,m2)
(%i73) k:jm_ket([j,m])
(%o73) [jmket,matrix([j,m])]
(%i74) JP(k)
(%o74) hbar*'jm_ket(j,m+1)*sqrt(j*(j+1)-m*(m+1))
(%i75) JM(k)
(%o75) hbar*'jm_ket(j,m-1)*sqrt(j*(j+1)-(m-1)*m)
(%i76) Jsqr(k)
(%o76) hbar^2*j*(j+1)*'jm_ket(j,m)
(%i77) Jz(k)
(%o77) hbar*'jm_ket(j,m)*m
(%i78) SP(1)
(%o78) matrix([0,sqrt(2)*hbar,0],[0,0,sqrt(2)*hbar],[0,0,0])
(%i79) SM(1)
(%o79) matrix([0,0,0],[sqrt(2)*hbar,0,0],[0,sqrt(2)*hbar,0])
(%i80) RZ(1/2,t)
Proviso: assuming 64*t # 0 
(%o80) matrix([%e^-((%i*t)/2),0],[0,%e^((%i*t)/2)])
(%i81) UU(w*Sy,t)
Proviso: assuming 64*t*w # 0 
(%o81) matrix([cos((t*w)/2),-sin((t*w)/2)],[sin((t*w)/2),cos((t*w)/2)])
(%i82) ketprod(zp,zm)
(%o82) ketprod(matrix([1],[0]),matrix([0],[1]))
(%i83) ketprod('zp,'zm)
(%o83) ketprod(zp,zm)
(%i84) kill(a,b,c,d)
(%o84) done
(%i85) declare([a,b,c,d],complex)
(%o85) done
(%i86) braprod(bra([a,b]),bra([c,d]))
(%o86) braprod(matrix([a,b]),matrix([c,d]))
(%i87) braprod(dagger(zp),bra([c,d]))
(%o87) braprod(matrix([1,0]),matrix([c,d]))
(%i88) K:ketprod(zp,zm)
(%o88) ketprod(matrix([1],[0]),matrix([0],[1]))
(%i89) zpb:dagger(zp)
(%o89) matrix([1,0])
(%i90) zmb:dagger(zm)
(%o90) matrix([0,1])
(%i91) B:braprod(zpb,zmb)
(%o91) braprod(matrix([1,0]),matrix([0,1]))
(%i92) braketprod(K,B)
(%o92) false
(%i93) braketprod(B,K)
(%o93) false
(%o94) "/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt"
