Loading /home/ehm/.maxima/maxima-init.mac
(%i1) batch("examples.txt")

read and interpret /home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt
(%i2) display2d:false
(%i3) load(qm)
(%i4) declare([c1,c2],complex)
(%o4) done
(%i5) ket(c1,c2)
(%o5) matrix([c1],[c2])
(%i6) facts()
(%o6) [kind(hbar,real),hbar > 0,kind(c1,complex),kind(c2,complex)]
(%i7) bra(c1,c2)
(%o7) matrix([c1,c2])
(%i8) facts()
(%o8) [kind(hbar,real),hbar > 0,kind(c1,complex),kind(c2,complex)]
(%i9) b:bra(a,b)
(%o9) matrix([a,b])
(%i10) ketp(b)
(%o10) false
(%i11) b:bra(a,b)
(%o11) matrix([a,matrix([a,b])])
(%i12) brap(b)
(%o12) false
(%i13) dag(bra(%i,2))
(%o13) matrix([-%i],[2])
(%i14) declare([a,b,c],complex)
(%o14) done
(%i15) braket(ket(a,b,c),ket(a,b,c))
(%o15) false
(%i16) declare([a,b,c],complex)
(%o16) done
(%i17) norm(ket(a,b,c))
(%o17) sqrt(false)
(%i18) declare([a,b,c,c],complex)
(%o18) done
(%i19) A:braket(ket(a,b),ket(c,d))
(%o19) false
(%i20) P:magsqr(A)
(%o20) false*conjugate(false)
(%i21) zp
(%o21) matrix([1],[0])
(%i22) zm
(%o22) matrix([0],[1])
(%i23) yp
(%o23) matrix([1/sqrt(2)],[%i/sqrt(2)])
(%i24) ym
(%o24) matrix([1/sqrt(2)],[-(%i/sqrt(2))])
(%i25) braket(xp,zp)
(%o25) 1/sqrt(2)
(%i26) declare([a,b],complex)
(%o26) done
(%i27) psi:ket(a,b)
(%o27) matrix([a],[matrix([a,matrix([a,b])])])
(%i28) psi_x:'xp*braket(xp,psi)+'xm*braket(xm,psi)
(%o28) xp*false+xm*false
(%i29) sigmay
(%o29) matrix([0,-%i],[%i,0])
(%i30) Sy
(%o30) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i31) commutator(Sx,Sy)
(%o31) matrix([(%i*hbar^2)/2,0],[0,-((%i*hbar^2)/2)])
(%i32) SY(1/2)
(%o32) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i33) SX(1)
(%o33) matrix([0,hbar/sqrt(2),0],[hbar/sqrt(2),0,hbar/sqrt(2)],[0,
                                                                hbar/sqrt(2),
                                                                0])
(%i34) ev(expect(Sy,xp+ym),ratsimp)
(%o34) -hbar
(%i35) ev(qm_variance(Sy,xp+ym),ratsimp)
(%o35) (%i*hbar)/2
(%i36) jm_bra(3/2,1/2)
(%o36) [jmbra,matrix([3/2,1/2])]
(%i37) K:jm_ket(zp,zm)
(%o37) [jmket,matrix([matrix([1],[0])],[matrix([0],[1])])]
(%i38) B:jm_bra(zp,zm)
(%o38) [jmbra,matrix([matrix([1],[0]),matrix([0],[1])])]
(%i39) jm_braket(B,K)
(%o39) 1
(%i40) SP(1)
(%o40) matrix([0,sqrt(2)*hbar,0],[0,0,sqrt(2)*hbar],[0,0,0])
(%i41) SM(1)
(%o41) matrix([0,0,0],[sqrt(2)*hbar,0,0],[0,sqrt(2)*hbar,0])
(%i42) RZ(1/2,t)
Proviso: assuming 64*t # 0 
(%o42) matrix([%e^-((%i*t)/2),0],[0,%e^((%i*t)/2)])
(%i43) UU(w*Sy,t)
Proviso: assuming 64*t*w # 0 
(%o43) matrix([cos((t*w)/2),-sin((t*w)/2)],[sin((t*w)/2),cos((t*w)/2)])
(%i44) ketprod(zp,zm)
(%o44) [tpket,[matrix([1],[0]),matrix([0],[1])]]
(%i45) ketprod('zp,'zm)
"all elements must be kets"

(%o45) done
(%i46) kill(a,b,c,d)
(%o46) done
(%i47) declare([a,b,c,d],complex)
(%o47) done
(%i48) braprod(bra(a,b),bra(c,d))
(%o48) [tpbra,[matrix([a,b]),matrix([c,d])]]
(%i49) braprod(dag(zp),bra(c,d))
(%o49) [tpbra,[matrix([1,0]),matrix([c,d])]]
(%i50) zpb:dag(zp)
(%o50) matrix([1,0])
(%i51) zmb:dag(zm)
(%o51) matrix([0,1])
(%i52) K:ketprod('zp,'zm)
"all elements must be kets"

(%o52) done
(%i53) B:braprod(zpb,zmb)
(%o53) [tpbra,[matrix([1,0]),matrix([0,1])]]
(%i54) B:braprod('zpb,'zmb)
"all elements must be bras"

(%o54) done
(%i55) braketprod(K,B)
(%o55) false
(%i56) braketprod(B,K)
(%o56) false
(%o57) "/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt"
