Loading /home/ehm/.maxima/maxima-init.mac
(%i1) batch("examples.txt")

read and interpret /home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt
(%i2) display2d:false
(%i3) load(qm)
(%i4) ket(a,b)+ket(c,d)
(%o4) ket(c,d)+ket(a,b)
(%i5) ket([a,b])+ket([c,d])
(%o5) matrix([c+a],[d+b])
(%i6) ketprod('zp,'zm)+ketprod('zm,'zp)
(%o6) ketprod(zp,zm)+ketprod(zm,zp)
(%i7) ketprod([zp,zm])
(%o7) [tpket,[matrix([1],[0]),matrix([0],[1])]]
(%i8) kill(a)
(%o8) done
(%i9) ket(a)
(%o9) ket(a)
(%i10) declare([c1,c2],complex)
(%o10) done
(%i11) ket([c1,c2])
(%o11) matrix([c1],[c2])
(%i12) facts()
(%o12) [kind(hbar,real),hbar > 0,kind(c1,complex),kind(c2,complex)]
(%i13) kill(c1,c2)
(%o13) done
(%i14) bra(c1,c2)
(%o14) bra(c1,c2)
(%i15) bra([c1,c2])
(%o15) matrix([c1,c2])
(%i16) facts()
(%o16) [kind(hbar,real),hbar > 0]
(%i17) kill(a,b,k)
(%o17) done
(%i18) k:ket(a,b)
(%o18) ket(a,b)
(%i19) ketp(k)
(%o19) false
(%i20) k:ket([a,b])
(%o20) matrix([a],[b])
(%i21) ketp(k)
(%o21) true
(%i22) b:bra([a,b])
(%o22) matrix([a,b])
(%i23) brap(b)
(%o23) true
(%i24) dagger(bra([%i,2]))
(%o24) matrix([-%i],[2])
(%i25) declare([a,b,c],complex)
(%o25) done
(%i26) braket(ket([a,b,c]),ket([a,b,c]))
(%o26) braket(matrix([a],[matrix([a,b])],[c]),matrix([a],[matrix([a,b])],[c]))
(%i27) declare([a,b,c],complex)
(%o27) done
(%i28) norm(ket([a,b,c]))
(%o28) norm(matrix([a],[matrix([a,b])],[c]))
(%i29) norm(ket(a,b,c))
(%o29) norm(ket(a,matrix([a,b]),c))
(%i30) declare([a,b,c,d],complex)
(%o30) done
(%i31) A:braket(ket([a,b]),ket([c,d]))
(%o31) braket(matrix([a],[matrix([a,b])]),matrix([c],[d]))
(%i32) P:magsqr(A)
(%o32) braket(matrix([a],[matrix([a,b])]),matrix([c],[d]))
 *conjugate(braket(matrix([a],[matrix([a,b])]),matrix([c],[d])))
(%i33) zp
(%o33) matrix([1],[0])
(%i34) zm
(%o34) matrix([0],[1])
(%i35) yp
(%o35) matrix([1/sqrt(2)],[%i/sqrt(2)])
(%i36) ym
(%o36) matrix([1/sqrt(2)],[-(%i/sqrt(2))])
(%i37) braket(xp,zp)
(%o37) 1/sqrt(2)
(%i38) declare([a,b],complex)
(%o38) done
(%i39) psi:ket([a,b])
(%o39) matrix([a],[matrix([a,b])])
(%i40) psi_x:'xp*braket(xp,psi)+'xm*braket(xm,psi)
(%o40) braket(matrix([1/sqrt(2)],[1/sqrt(2)]),matrix([a],[matrix([a,b])]))*xp
 +braket(matrix([1/sqrt(2)],[-(1/sqrt(2))]),matrix([a],[matrix([a,b])]))*xm
(%i41) sigmay
(%o41) matrix([0,-%i],[%i,0])
(%i42) Sy
(%o42) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i43) commutator(Sx,Sy)
(%o43) matrix([(%i*hbar^2)/2,0],[0,-((%i*hbar^2)/2)])
(%i44) SY(1/2)
(%o44) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i45) SX(1)
(%o45) matrix([0,hbar/sqrt(2),0],[hbar/sqrt(2),0,hbar/sqrt(2)],[0,
                                                                hbar/sqrt(2),
                                                                0])
(%i46) ev(expect(Sy,xp+ym),ratsimp)
(%o46) -hbar
(%i47) ev(qm_variance(Sy,xp+ym),ratsimp)
(%o47) (%i*hbar)/2
(%i48) jm_bra(3/2,1/2)
(%o48) jm_bra(3/2,1/2)
(%i49) K:jm_ket(j1,m1)
(%o49) jm_ket(j1,m1)
(%i50) B:jm_bra(j2,m2)
(%o50) jm_bra(j2,m2)
(%i51) jm_braket(B,K)
(%o51) jm_braket(jm_bra(j2,m2),jm_ket(j1,m1))
(%i52) B:jm_bra(j1,m1)
(%o52) jm_bra(j1,m1)
(%i53) jm_braket(B,K)
(%o53) jm_braket(jm_bra(j1,m1),jm_ket(j1,m1))
(%i54) k:jm_ket(j,m)
(%o54) jm_ket(j,m)
(%i55) JP(k)
(%o55) false
(%i56) JM(k)
(%o56) false
(%i57) Jsqr(k)
(%o57) false
(%i58) Jz(k)
(%o58) false
(%i59) SP(1)
(%o59) matrix([0,sqrt(2)*hbar,0],[0,0,sqrt(2)*hbar],[0,0,0])
(%i60) SM(1)
(%o60) matrix([0,0,0],[sqrt(2)*hbar,0,0],[0,sqrt(2)*hbar,0])
(%i61) RZ(1/2,t)
Proviso: assuming 64*t # 0 
(%o61) matrix([%e^-((%i*t)/2),0],[0,%e^((%i*t)/2)])
(%i62) UU(w*Sy,t)
Proviso: assuming 64*t*w # 0 
(%o62) matrix([cos((t*w)/2),-sin((t*w)/2)],[sin((t*w)/2),cos((t*w)/2)])
(%i63) ketprod(zp,zm)
(%o63) ketprod(matrix([1],[0]),matrix([0],[1]))
(%i64) ketprod('zp,'zm)
(%o64) ketprod(zp,zm)
(%i65) kill(a,b,c,d)
(%o65) done
(%i66) declare([a,b,c,d],complex)
(%o66) done
(%i67) braprod(bra([a,b]),bra([c,d]))
(%o67) braprod(matrix([a,b]),matrix([c,d]))
(%i68) braprod(dagger(zp),bra([c,d]))
(%o68) braprod(matrix([1,0]),matrix([c,d]))
(%i69) K:ketprod(zp,zm)
(%o69) ketprod(matrix([1],[0]),matrix([0],[1]))
(%i70) zpb:dagger(zp)
(%o70) matrix([1,0])
(%i71) zmb:dagger(zm)
(%o71) matrix([0,1])
(%i72) B:braprod(zpb,zmb)
(%o72) braprod(matrix([1,0]),matrix([0,1]))
(%i73) braketprod(K,B)
(%o73) false
(%i74) braketprod(B,K)
(%o74) false
(%o75) "/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt"
