Loading /home/ehm/.maxima/maxima-init.mac
(%i1) batch("examples.txt")

read and interpret /home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt
(%i2) display2d:false
(%i3) load(qm)
(%i4) ket(a,b)+ket(c,d)
(%o4) ket(c,d)+ket(a,b)
(%i5) ket([a,b,c])+ket([d,e,f])
(%o5) matrix([d+a],[e+b],[f+c])
(%i6) braket(bra(a1,b1),ket(a2,b2))
(%o6) kron_delta(a1,b1)*kron_delta(a2,b2)
(%i7) tpket('zp,'zm)+tpket('zm,'zp)
(%o7) tpket(zp,zm)+tpket(zm,zp)
(%i8) tpket([zp,zm])
(%o8) [tpket,[matrix([1],[0]),matrix([0],[1])]]
(%i9) declare([a,b],complex)
(%o9) done
(%i10) psi:a*ket(1)+b*ket(2)
(%o10) ket(2)*b+ket(1)*a
(%i11) psidag:dagger(psi)
(%o11) bra(2)*conjugate(b)+bra(1)*conjugate(a)
(%i12) psidag . psi
(%o12) b*conjugate(b)+a*conjugate(a)
(%i13) declare([c1,c2],complex,r,real)
(%o13) done
(%i14) k:ket([c1,c2,r])
(%o14) matrix([c1],[c2],[r])
(%i15) b:dagger(k)
(%o15) matrix([conjugate(c1),conjugate(c2),r])
(%i16) b . k
(%o16) r^2+c2*conjugate(c2)+c1*conjugate(c1)
(%i17) kill(a)
(%o17) done
(%i18) ket(a)
(%o18) ket(a)
(%i19) declare([c1,c2],complex)
(%o19) done
(%i20) ket([c1,c2])
(%o20) matrix([c1],[c2])
(%i21) facts()
(%o21) [kind(hbar,real),hbar > 0,kind(b,complex),kind(c1,complex),
        kind(c2,complex),kind(r,real)]
(%i22) kill(c1,c2)
(%o22) done
(%i23) bra(c1,c2)
(%o23) bra(c1,c2)
(%i24) bra([c1,c2])
(%o24) matrix([c1,c2])
(%i25) facts()
(%o25) [kind(hbar,real),hbar > 0,kind(b,complex),kind(r,real)]
(%i26) kill(a,b,k)
(%o26) done
(%i27) k:ket(a,b)
(%o27) ket(a,b)
(%i28) ketp(k)
(%o28) false
(%i29) k:ket([a,b])
(%o29) matrix([a],[b])
(%i30) ketp(k)
(%o30) true
(%i31) b:bra([a,b])
(%o31) matrix([a,b])
(%i32) brap(b)
(%o32) true
(%i33) autoket([a,b])
(%o33) matrix([a],[matrix([a,b])])
(%i34) facts()
(%o34) [kind(hbar,real),hbar > 0,kind(r,real),kind(a,complex)]
(%i35) autoket([a*sin(x),b*sin(x)])
(%o35) matrix([a*sin(x)],[matrix([a*sin(x),b*sin(x)])])
(%i36) facts()
(%o36) [kind(hbar,real),hbar > 0,kind(r,real),kind(a,complex)]
(%i37) autobra([a,b])
(%o37) matrix([a,matrix([a,b])])
(%i38) facts()
(%o38) [kind(hbar,real),hbar > 0,kind(r,real),kind(a,complex)]
(%i39) autobra([a*sin(x),b])
(%o39) matrix([a*sin(x),matrix([a,b])])
(%i40) facts()
(%o40) [kind(hbar,real),hbar > 0,kind(r,real),kind(a,complex)]
(%i41) dagger(bra([%i,2]))
(%o41) matrix([-%i],[2])
(%i42) declare([a,b,c],complex)
(%o42) done
(%i43) braket(ket([a,b,c]),ket([a,b,c]))
(%o43) braket(matrix([a],[matrix([a,b])],[c]),matrix([a],[matrix([a,b])],[c]))
(%i44) declare([a,b,c],complex)
(%o44) done
(%i45) norm(ket([a,b,c]))
(%o45) norm(matrix([a],[matrix([a,b])],[c]))
(%i46) norm(ket(a,b,c))
(%o46) norm(ket(a,matrix([a,b]),c))
(%i47) declare([a,b,c,d],complex)
(%o47) done
(%i48) A:braket(ket([a,b]),ket([c,d]))
(%o48) braket(matrix([a],[matrix([a,b])]),matrix([c],[d]))
(%i49) P:magsqr(A)
(%o49) braket(matrix([a],[matrix([a,b])]),matrix([c],[d]))
 *conjugate(braket(matrix([a],[matrix([a,b])]),matrix([c],[d])))
(%i50) ket(a)+ket(b)
(%o50) ket(matrix([a,b]))+ket(a)
(%i51) braket(bra(a),ket(b))
(%o51) 0
(%i52) braket(bra(a)+bra(c),ket(b))
(%o52) 0
(%i53) zp
(%o53) matrix([1],[0])
(%i54) zm
(%o54) matrix([0],[1])
(%i55) yp
(%o55) matrix([1/sqrt(2)],[%i/sqrt(2)])
(%i56) ym
(%o56) matrix([1/sqrt(2)],[-(%i/sqrt(2))])
(%i57) braket(xp,zp)
(%o57) 1/sqrt(2)
(%i58) declare([a,b],complex)
(%o58) done
(%i59) psi:ket([a,b])
(%o59) matrix([a],[matrix([a,b])])
(%i60) psi_x:'xp*braket(xp,psi)+'xm*braket(xm,psi)
(%o60) braket(matrix([1/sqrt(2)],[1/sqrt(2)]),matrix([a],[matrix([a,b])]))*xp
 +braket(matrix([1/sqrt(2)],[-(1/sqrt(2))]),matrix([a],[matrix([a,b])]))*xm
(%i61) sigmay
(%o61) matrix([0,-%i],[%i,0])
(%i62) Sy
(%o62) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i63) commutator(Sx,Sy)
(%o63) matrix([(%i*hbar^2)/2,0],[0,-((%i*hbar^2)/2)])
(%i64) SY(1/2)
(%o64) matrix([0,-((%i*hbar)/2)],[(%i*hbar)/2,0])
(%i65) SX(1)
(%o65) matrix([0,hbar/sqrt(2),0],[hbar/sqrt(2),0,hbar/sqrt(2)],[0,
                                                                hbar/sqrt(2),
                                                                0])
(%i66) ev(expect(Sy,xp+ym),ratsimp)
(%o66) -hbar
(%i67) ev(qm_variance(Sy,xp+ym),ratsimp)
(%o67) (%i*hbar)/2
(%i68) jmbra(3/2,1/2)
(%o68) jmbra(3/2,1/2)
(%i69) jmbra([3/2,1/2])
(%o69) [jmbra,matrix([3/2,1/2])]
(%i70) jmketp(jmket(j,m))
(%o70) false
(%i71) jmketp(jmket([j,m]))
(%o71) true
(%i72) jmcheck(3/2,1/2)
(%o72) true
(%i73) K:jmket(j1,m1)
(%o73) jmket(j1,m1)
(%i74) B:jmbra(j2,m2)
(%o74) jmbra(j2,m2)
(%i75) jmbraket(B,K)
(%o75) kron_delta(j1,j2)*kron_delta(m1,m2)
(%i76) B:jmbra(j1,m1)
(%o76) jmbra(j1,m1)
(%i77) jmbraket(B,K)
(%o77) 1
(%i78) K:jmket([3/2,1/2])
(%o78) [jmket,matrix([3/2,1/2])]
(%i79) B:jmbra([3/2,1/2])
(%o79) [jmbra,matrix([3/2,1/2])]
(%i80) jmbraket(B,K)
(%o80) 1
(%i81) jmbraket(jmbra(j1,m1),jmket(j2,m2))
(%o81) kron_delta(j1,j2)*kron_delta(m1,m2)
(%i82) k:jmket([j,m])
(%o82) [jmket,matrix([j,m])]
(%i83) JP(k)
(%o83) hbar*'jmket(j,m+1)*sqrt(j*(j+1)-m*(m+1))
(%i84) JM(k)
(%o84) hbar*'jmket(j,m-1)*sqrt(j*(j+1)-(m-1)*m)
(%i85) Jsqr(k)
(%o85) hbar^2*j*(j+1)*'jmket(j,m)
(%i86) Jz(k)
(%o86) hbar*'jmket(j,m)*m
(%i87) SP(1)
(%o87) matrix([0,sqrt(2)*hbar,0],[0,0,sqrt(2)*hbar],[0,0,0])
(%i88) SM(1)
(%o88) matrix([0,0,0],[sqrt(2)*hbar,0,0],[0,sqrt(2)*hbar,0])
(%i89) RZ(1/2,t)
Proviso: assuming 64*t # 0 
(%o89) matrix([%e^-((%i*t)/2),0],[0,%e^((%i*t)/2)])
(%i90) UU(w*Sy,t)
Proviso: assuming 64*t*w # 0 
(%o90) matrix([cos((t*w)/2),-sin((t*w)/2)],[sin((t*w)/2),cos((t*w)/2)])
(%i91) K:tpket(a1,b1)
(%o91) tpket(a1,b1)
(%i92) B:tpbra(a2,b2)
(%o92) tpbra(a2,b2)
(%i93) tpbraket(B,K)
(%o93) kron_delta(a1,a2)*kron_delta(b1,b2)
(%i94) kill(a,b,c,d)
(%o94) done
(%i95) declare([a,b,c,d],complex)
(%o95) done
(%i96) tpbra([bra([a,b]),bra([c,d])])
(%o96) [tpbra,[matrix([a,b]),matrix([c,d])]]
(%i97) tpbra([dagger(zp),bra([c,d])])
(%o97) [tpbra,[matrix([1,0]),matrix([c,d])]]
(%i98) K:tpket([zp,zm])
(%o98) [tpket,[matrix([1],[0]),matrix([0],[1])]]
(%i99) zpb:dagger(zp)
(%o99) matrix([1,0])
(%i100) zmb:dagger(zm)
(%o100) matrix([0,1])
(%i101) B:tpbra([zpb,zmb])
(%o101) [tpbra,[matrix([1,0]),matrix([0,1])]]
(%i102) tpbraket(K,B)
(%o102) false
(%i103) tpbraket(B,K)
(%o103) 1
(%o104) "/home/ehm/math/Maxima/share/ehm/qm-maxima/docs/examples.txt"
